import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class DetailPage4 extends StatelessWidget {
  final String imagePath;

  const DetailPage4({Key? key, required this.imagePath}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    Color? appBarColor = Theme.of(context).brightness == Brightness.light
        ?  Color(0xFF4A5367) // Warna hijau untuk light mode
        : Theme.of(context).appBarTheme.backgroundColor; // Mengikuti warna dark mode

    Color textColor = Theme.of(context).brightness == Brightness.light
        ? Colors.black
        : Colors.white; // Text color for light mode and dark mode

    return Scaffold(
      appBar: AppBar(
        shape: RoundedRectangleBorder(
          borderRadius: BorderRadius.only(
            bottomLeft: Radius.circular(20),
            bottomRight: Radius.circular(20),
          ),
        ),
        title: Text(
          'QOSIDAH BURDAH',
          style: GoogleFonts.anton(fontSize: 20),
        ),
        centerTitle: true,
        backgroundColor: appBarColor,
        actions: [
          IconButton(
            icon: Icon(Icons.bookmark),
            onPressed: () {
              // Add your bookmark functionality here
            },

          ),
        ],
      ),

      body: Container(
        width: double.infinity,
        height: double.infinity,
        child: Stack(
          children: [
            SingleChildScrollView(
              child: Column(
                children: [
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          text: 'بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ \n',
                          style: GoogleFonts.scheherazadeNew(
                              color: textColor,
                              fontSize: 25,fontWeight: FontWeight.bold
                          ),
                          children: <TextSpan>[
                            TextSpan(
                              text:'الحَمْدُ لِله مُنْشِى الْخَلْقِ مِنْ عَدَمِ ۞ ثُمَّ الصَّلَاةُ عَلَى الْمُخْتَارِ فِي الْقِدَمِ'
                              '\n'
                              'َمَوْلَايَ صَلّ وَسَلّمْ دَائِمًا أَبَدَا ۞ عَلَى حَبِيْبِكَ خَيْرِ خَلْقِ كُلّهِمِ'
                              '\n'
                              'َيَارَبّ صَلّ عَلَى مَنْ حَلَّ فِي الْحَرَم ۞ مُحَمّدِالْمُصْطَفَى مَنْ خُصَّبِالْكَرَمِ'
                              '\n'
                              'ِأَمِنْ تَذَكُّـرِ جِيرَانٍ بِذِى سَـلَم ۞ مَزَجْتَ دَمْعاً جَرَى مِن مُقلَةٍ بِدَم'
                              '\n'
                                  'ِأَمِنْ تَذَكُّـرِ جِيرَانٍ بِذِى سَـلَم ۞ مَزَجْتَ دَمْعاً جَرَى مِن مُقلَةٍ بِدَم'
                              '\n'
                                  'ِفَمَا لِعَيْنَيْكَ إنْ قُلْتَ اكْفُفَا هَمَتَا ۞ وَمَا لِقَلْبِكَ إنْ قُلْتَ اسْتَفِقْ يَهِم'
                              '\n'
                              'أَيَحْسَبُ الصَّبُّ أَنَّ الحُبَّ مُنْكَتِـمٌ ۞ مَا بَيْنَ مُنْسَجِمٍ مِنْهُ وَمُضْطَرِم'
                              '\n'
                              'لَوْلَا الْهَوَى لَمْ تُرِقْ دَمْعاً عَلَى طَلَلٍ ۞ وَلَا أَرِقْتَ لِذِكْرِ البَانِ وَالعَلَـمِ'
                              '\n'
                              'فَكَيْفَ تُنْكِرُ حُباً بَعْدَ مَا شَهِدَتْ ۞ بِهِ عَلَيْكَ عُدُولُ الدَّمْعِ وَالسَّقَمِ'
                                  '\n'
                                  'وَأَثْبَتَ الوَجْدُ خَطَّيْ عَبْرَةٍ وَضَنَى ۞ مِثْلَ البَهَارِ عَلَى خَدَّيْكَ وَالعَنَم'
                                  '\n'
                                  'نَعَمْ سَرَى طَيْفُ مَنْ أَهْوَى فَأَرَّقَنِي ۞ وَالحُبُّ يَعْتَرِضُ اللَّذَّاتِ بِالأَلَمِ'
                                  '\n'
                                  'يَا لَائِمِي فِي الهَوَى العُذْرِيِّ مَعْذِرَةً ۞ مِنَّي إِلَيْكَ وَلَوْ أَنْصَفْتَ لَمْ تَلُمِ'
                                  '\n'
                                  'عَدَتْكَ حَالِي لَا سِرِّي بِمُسْتَتِر ۞ عَنِ الوُشَاةِ وَلَا دَائِي بِمُنْحَسِم'
                                  '\n'
                                  'مَحَضْتَنِي النُّصْحَ لَكِنْ لَسْتُ أَسْمَعُهُ ۞ إنَّ المُحِبَّ عَنِ العُذَّالِ فِي صَمَمِ'
                                  '\n'
                                  'إن!ِى اتَّهَمْتُ نَصِيحَ الشَّيْبِ فِي عَذِلِي ۞ وَالشَّيْبُ أَبْعَدُ فِي نُصْحٍ عَنِ التُّهَمِ'
                              '\n',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                             '<<الفصل الثاني>>'
                                  '\n'
                                 'فَإنَّ أَمَّارَتِي بِالسُّوءِ مَا اتَّعَظَت  ۞  مِنْ جَهْلِهَا بِنَذِيرِ الشَّيْبِ وَالهَرَم'
                                  '\n'
                                 'وَلَا أَعَدَّتْ مِنَ الفِعْلِ الجَمِيلِ قِرَى ۞ ضَيْفٍ أَلَمَّ بِرَأسِي غَيْرَ مُحْتَشَم'
                                  '\n'
                                 'لَوْ كُنْتُ أَعْلَمُ أَنِّي مَا أُوَقِّرُهُ ۞ كَتَمْتُ سِراًّ بَدَا لِي مِنْهُ بِالكَتَمِ'
                                 '\n'
                                 'مَنْ لِي بِرِّدِّ جِمَاحٍ مِنْ غَوَايَتِهَا ۞ كُمَا يُرَدُّ جِمَاحُ الخَيْلِ بِاللُّجُمِ'
                                 '\n'
                                 'فَلَا تَرُمْ بِالمَعَاصِي كَسْرَ شَهْوَتِهَا ۞ إنَّ الطَّعَامَ يُقَوِّي شَهْوَةَ النَّهِمِ'
                                 '\n'
                                 'وَالنَّفْسُ كَالطِّفْلِ إنْ تُهْمِلْهُ شَبَّ عَلَى ۞ حُبِّ الرَّضَاعِ وَإنْ تَفْطِمْهُ يَنْفَطِمِ'
                                 '\n'
                                 'فَاصْرِفْ هَوَاهَا وَحَاذِر أَنْ تُوَلِّيَهُ ۞ إنَّ الهَوَى مَا تَوَلَّى يُصْمِ أَوْ يَصِمِ'
                                 '\n'
                                 'وَرَاعِهَا وَهْيَ فِي الأعْمَالِ سَائِمَةٌ ۞ وَإنْ هِيَ اسْتَحْلَتِ المَرْعَى فَلَا تَسِمِ'
                                 '\n'
                                 'كَمْ حَسَّنَتْ لَذَّةً لِلْمَرْءِ قَاتِلَةً ۞ مِنْ حَيْثُ لَمْ يَدْرِ أَنَّ السُّمَّ فِى الدَّسَم'
                                 '\n'
                                 'وَاخْشَ الدَّسَائِسَ مِنْ جُوعٍ وَمِنْ شِبَعٍ ۞ فَرُبَّ مَخْمَصَةٍ شَرٌّ مِنَ التُّخَمِ'
                                 '\n'
                                 'وَاسْتَفْرِغِ الدَّمْعَ مِنْ عَيْنٍ قَدِ امْتَلَأَتْ ۞ مِنَ المَحَارِمِ وَالْزَمْ حِمْيَةَ النَّدَمِ'
                                 '\n'
                                 'وَخَالِفِ النَّفْسَ وَالشَّيْطَانَ وَاعْصِهِمَا ۞ وَإنْ هُمَا مَحَّضَاكَ النُّصْحَ فَاتَّهِمِ'
                                 '\n'
                                 'وَلَا تُطِع مِنْهُمَا خَصْماً وَلَا حَكَماً ۞ فَأَنْتَ تَعْرِفُ كَيْدَ الخَصْمِ وَالحَكَم'
                                 '\n'
                                 'أَسْتَغْفِرُ اللَّهَ مِنْ قَولٍ بِلَا عَمَلٍ ۞ لَقَدْ نَسَبتُ بِهِ نَسْلاً لِذِي عُقُمِ'
                                 '\n'
                                 'أَمَرْتُكَ الخَيْرَ لَكِن مَا ائْتَمَرْتُ بِهِ ۞ وَمَا اسْتَقَمْتُ فَمَا قَولِى لَكَ اسْتَقِمِ'
                                 '\n'
                                 'وَلَا تَزَوَّدْتُ قَبْلَ المَوْتِ نَافِلَةً ۞ وَلَمْ أُصَلِّ سِوَى فَرْضٍ وَلَمْ أَصُمِ'
                                 '\n',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                              '<<الفصل الثالث>>'
                                  '\n'
                                  'ظَلَمْتُ سُنَّةَ مَنْ أَحْيَا الظَّلَامَ إِلَى ۞ أَنِ اشْتَكَتْ قَدَمَاهُ الضُّرَّ مِنْ وَرَم'
                                  '\n'
                                  'وَشَدَّ مِنْ سَغَبٍ أَحْشَاءَهُ وَطَوَى ۞ تَحْتَ الحِجَارَةِ كَشْحاً مُتْرَفَ الأَدَم'
                                  '\n'
                                  'وَرَاوَدَتْهٌ الجِبَالُ الشُّمُّ مِنْ ذَهَـبٍ ۞ عَنْ نَفْسِهِ فَأَرَاهَا أَيَّمَا شَمَمِ'
                                  '\n'
                                  'وَأَكَّدَتْ زُهْدَهُ فِيهَا ضَرُورَتُهُ ۞ إنَّ الضَرَورَةَ لَا تَعْدُو عَلَى العِصَمِ'
                                  '\n'
                                  'وَكَيْفَ تَدْعُو إلَى الدُّنْيَا ضَرُورَةُ مَنْ ۞ لَوْلَاهُ لَمْ تُخْرَجِ الدُّنْيَا مِنَ العَدَمِ'
                                  '\n'
                                  'مُحَمَّدٌ سَيِّدُ الكَوْنَيْنِ وَالثَّقَلَيْنِ ۞ وَالفَرِيقَيْنِ مِنْ عُرْبٍ وَمِنْ عَجَمِ'
                                  '\n'
                                  'نَبِيُّنَا الآمِرُ النَاهِي فَلَا أَحَدٌ ۞ أَبَرَّ فِي قَوْلٍ لَا مِنْهُ وَلَا نَعَم'
                                  '\n'
                                  'هُوَ الحَبِيبُ الَّذِي تُرْجَى شَفَاعَتُهُ ۞ لِكُلِّ هَوْلٍ مِنَ الأَهْوَالِ مُقْتَحِمِ'
                                  '\n'
                                  'دَعَا إَلَى اللَّهِ فَالمُسْتَمْسِكُونَ بِهِ ۞ مُسْتَمْسِكُونَ بِحَبْلٍ غَيْرِ مُنْفَصِمِ'
                                  '\n'
                                  'فَاقَ النَّبِيِّينَ فِي خَلْقٍ وَفِي خُلُقٍ ۞ وَلَمْ يُدَانُوهُ فِي عِلْمٍ وَلَا كَرَم'
                                  '\n'
                                  'وَكُلُّهُم مِنْ رَسُولِ اللَّهِ مُلْتَمِسٌ ۞ غَرْفاً مِنَ البَحْرِ أَوْ رَشْفاً مِنَ الدِّيَمِ'
                                  '\n'
                                  'وَوَاقِفُونَ لَدَيْهِ عِنْدَ حَدِّهِمِ ۞ مِنْ نٌقْطَةِ العِلْمِ أَوْ مِنْ شَكْلَةِ الحِكَمِ'
                                  '\n'
                                  'فَهُوَ الَّذِي تَمَّ مَعْنَاهُ وَصُورَتُهُ ۞ ثُمَّ اصْطَفَاهُ حَبِيباً بَارِئُ النَّسَمِ'
                                  '\n'
                                  'مُنَزَّهٌ عَنْ شَرِيكٍ فِي مَحَاسِنِهِ ۞ فَجَوْهَرُ الحُسْنِ فِيهِ غَيْرُ مُنْقَسِمِ'
                                  '\n'
                                  'دَعْ مَا ادَّعَتْهُ النَّصَارَى فِي نَبِيِّهِمِ ۞ وَاحْكُمِ بِمَا شِئْتَ مَدْحاً فِيهِ وَاحْتَكِمِ'
                                  '\n'
                                  'وَانْسُبْ إِلَى ذَاتِهِ مَا شِئْتَ مِنْ شَرَفٍ ۞ وَانْسُبْ إلَى قَدْرِهِ مَا شِئْتَ مِنْ عِظَمِ'
                                  '\n'
                                  'فَإنَّ فَضْلَ رَسُولِ اللَّهِ لَيْسَ لَهُ ۞ حَدٌّ فَيُعْرِبُ عَنْهُ نَاطِقٌ بِفَمِ'
                                  '\n'
                                  'لَوْ نَاسَبَتْ قَدْرَهُ آيَاتُهُ عِظَماً ۞ أَحْيَا اسْمُهُ حِينَ يُدْعَى دَارِسَ الرِّمَمِ'
                                  '\n'
                                  'لَمْ يَمْتَحِنَّا بِمَا تَعْيَا العُقُولُ بِهِ ۞ حِرْصاً عَلَينَا فَلَم نرْتَبْ وَلَم نَهِمِ'
                                  '\n'
                                  'أَعْيَا الوَرَى فَهْمُ مَعْنَاهُ فَلَيْسَ يُرَى ۞ فِي القُرْبِ وَالبُعْدِ فِيهِ غَيْرُ مُنْفَحِمِ'
                                  '\n'
                                  'كَالشَّمْسِ تَظْهَرُ لِلْعَيْنَيِنِ مِنْ بُعُدٍ ۞ صَغِيرَةً وَتُكِلُّ الطَّرْفَ مِنْ أَمَمِ'
                                  '\n'
                                  'وَكَيْفَ يُدْرِكُ فِي الدُّنْيَا حَقِيقَتَهُ ۞ قَوْمٌ نِيَامٌ تَسَلَّوا عَنْهُ بِالحُلُمِ'
                                  '\n'
                                  'فَمَبْلَغُ العِلْمِ فِيهِ أَنَّهُ بَشَرٌ ۞ وَأَنَّهُ خَيْرُ خَلْقِ اللَّهِ كُلِّهِمِ'
                                  '\n'
                                  'وَكُلُّ آيٍ أَتَى الرُّسْلُ الكِرَامُ بِهَا ۞ فَإنَّمَا اتَّصَلَتْ مِن نُورِهِ بِهِم'
                                  '\n'
                                  'فَإنَّهُ شَمْسُ فَضْلٍ هُمْ كَوَاكِبُهَا ۞ يُظْهِرْنَ أَنْوَارَهَا لِلنَّاسِ فِي الظُّلُمِ'
                                  '\n'
                                  'أَكْرِم بِخَلْقِ نَبِيّ زَانَهُ خُلُقٌ ۞ بِالحُسْنِ مُشْتَمِلٍ بِالبِشْرِ مُتَّسِمِ'
                                  '\n'
                                  'كَالزَّهْرِ فِي تَرَفٍ وَالبَدْرِ فِي شَرَفٍ ۞ وَالبَحْرِ فِي كَرَمٍ وَالدَّهْرِ فِي هِمَمِ'
                                  '\n'
                                  'كَأَنَّهُ وَهُوَ فَرْدٌ مِنْ جَلَالَتِهِ ۞ فِي عَسْكَرٍ حِينَ تَلْقَاهُ وَفِي حَشَمِ'
                                  '\n'
                                  'كَأَنَّمَا اللُّؤْلُؤُ المَكْنُونُ فِى صَدَفٍ ۞ مِنْ مَعْدِنَي مَنْطِقٍ مِنْهُ وَمُبْتَسِمِ'
                                  '\n'
                                  'لَا طِيبَ يَعْدِلُ تُرْباً ضَمَّ أَعْظُمَهُ ۞ طُوبَى لِمُنْتَشِقٍ مِنْهُ وَمُلَتَثِ'
                                  '\n',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                              '<<الفصل الرابع>> '
                                  '\n'
                                  'أَبَانَ مَوْلِدُهُ عَنْ طِيبِ عُنْصُرِهِ ۞ يَا طِيبَ مًبْتَدَإٍ مِنْهُ وَمُخْتَتَمِ'
                                  '\n'
                                  'يَوْمٌ تَفَرَّسَ فِيهِ الفُرْسُ أَنَّهُمُ ۞ قَدْ أَنْذِرُوا بِحُلُولِ البُؤْسِ وَالنِقَمِ'
                                  '\n'
                                  'وَبَاتَ إيوَانُ كِسْرَى وَهُوَ مْنْصَدِعٌ ۞ كَشَمْلِ أَصْحَابِ كِسْرَى غَيْرَ مُلْتَئِمِ'
                                  '\n'
                                  'وَالنَّارُ خَامِدَةُ الأَنْفَاسِ مِنْ أَسَفٍ ۞ عَلَيهِ وَالنَّهْرُ سَاهِي العَيْنِ مِنْ سَدَمِ'
                                  '\n'
                                  'وَسَاءَ سَاوَةَ أَنْ غَاضَتْ بُحَيْرَتُهَا ۞ وَرُدَّ وَارِدُهَا بِالغَيْظِ حِينَ ظَمِي'
                                  '\n'
                                  'كَأَنَّ بِالنَّارِ مَا بِالمَاءِ مِنْ بَلَلٍ ۞ حُزْناً وَبِالمَاءِ مَا بِالنَّارِ مِنْ ضَرَمِ'
                                  '\n'
                                  'وَالجِنُّ تَهْتِفُ وَالأَنْوَارُ سَاطِعَةٌ ۞ وَالحَقُّ يَظْهَرُ مِنْ مَعْنىُ وَمِنْ كَلِم'
                                  '\n'
                                  'عَمُوا وَصَمُّوا فَإعْلَانُ البَشَائِرِ لَمْ ۞ تُسْمَعْ وَبَارِقَةُ الإنْذَارِ لَمْ تُشَمِ'
                                  '\n'
                                  'مِنْ بَعْدِ مَا أَخْبَرَ الأقْوَامَ كَاهِنُهُمْ ۞ بِأَنَّ دِينَهُمُ المُعْوَجَّ لَمْ يَقُمِ'
                                  '\n'
                                  'وَبَعْدَ مَا عَايَنُوا فِي الأُفْقِ مِنْ شُهُبٍ ۞ مُنْقَضَّةٍ وَفْقَ مَا فِي الأرْضِ مِنْ صَنَمِ'
                                  '\n'
                                  'حَتَّى غَدَا عَنْ طَرِيقِ الوَحْيِ مُنْهَزِمٌ ۞ مِنَ الشَّيَاطِينِ يَقْفُو إثْرَ مُنْهَزِم'
                                  '\n'
                                  'كَأنَّهُمْ هَرَباً أَبْطَالُ أَبْرَهَةٍ ۞ أَوْ عَسْكَرٌ بِالحَصَى مِنْ رَاحَتَيْهِ رُمِى'
                                  '\n'
                                  'نَبْذاً بِهِ بَعْدَ تَسْبِيحٍ بِبَطْنِهِمَا ۞ نَبْذَ المُسَبِّحِ مِنْ أحْشَاءِ مُلْتَقِمِ'
                                  '\n',
                                      
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                              '<<الفصل الخامس>>'
                                  '\n'
                                  'جَاءَتْ لِدَعْوَتِهِ الأَشْجَارُ سَاجِدَةً ۞ تَمْشِى إِلَيْهِ عَلَى سَاقٍ بِلَا قَدَمِ'
                                  '\n'
                                  'كأنَّمَا سَطَرَتْ سَطْراً لِمَا كَتَبَتْ ۞ فُرُوعُهَا مِنْ بَدِيعِ الخَطِّ فِي اللَّقَمِ'
                                  '\n'
                                  'مِثْلُ الغَمَامَةِ أنَّى سَارَ سَائِرَةُ ۞ تَقِيهِ حَرَّ وَطِيسٍ لِلْهَجِيرِ حَمِي'
                                  '\n'
                                  'أَقْسَمْتُ بِالقَمَرِ المُنْشَقِّ إنَّ لَهُ ۞ مِنْ قَلْبِهِ نِسْبَةً مَبْرُورَةَ القَسَمِ'
                                  '\n'
                                  'وَمَا حَوَى الغَارُ مِنْ خَيْرٍ وَمِنْ كَرَمٍ ۞ وَكُلُّ طَرْفٍ مِنَ الكُفَّارِ عَنْهُ عَمِي'
                                  '\n'
                                  'فَالصِّدْقُ فِي الغَارِ وَالصِّدِّيقُ لَمْ يَرِمَا ۞ وَهُمْ يَقُوْلُونَ مَا بِالغَارِ مِنْ أَرِمِ'
                                  '\n'
                                  'ظَنُّوا الحَمَامَ وَظَنُّوا العَنْكَبُوتَ عَلَى ۞ خَيْرِ البَرِيَّةِ لَمْ تَنْسِجْ وَلَمْ تَحُمِ'
                                  '\n'
                                  'وِقَايَةُ اللَّهِ أَغْنَتْ عَنْ مُضَاعَفَةٍ ۞ مِنَ الدُّرُوعِ وَعَنْ عَالٍ مِنَ الأُطُمِ'
                                  '\n'
                                  'مَا سَامَنِى الدَّهْرُ ضَيْماً وَاسْتَجَرْتُ بِهِ ۞ إِلَّا وَنِلْتُ جِوَاراً مِنْهُ لَمْ يُضَمِ'
                                  '\n'
                                  'وَلَا الْتَمَسْتُ غِنَى الدَّارَيْنِ مِنْ يَدِهِ ۞ إِلَّا اسْتَلَمْتُ النَّدَى مِنْ خَيْرِ مُسْتَلِمِ'
                                  '\n'
                                  'لَا تُنْكِرِ الوَحْيَ مِنْ رُؤْيَاهُ إِنَّ لَهُ ۞ قَلْباً إذَا نَامَتِ العَيْنَانِ لَمْ يَنَمِ'
                                  '\n'
                                  'وَذَاكَ حِينَ بُلُوغٍ مِنْ نُبُوَّتِهِ ۞ فَلَيْسَ يُنْكَرُ فِيهِ حَالُ مُحْتَلِمِ'
                                  '\n'
                                  'تَبَارَكَ اللَّهُ مَا وَحْيٌ بِمُكْتَسَبٍ ۞ وَلَا نَبِيٌّ عَلَى غَيْبٍ بِمُتَّهَم'
                                  '\n'
                                  'كَمْ أَبْرَأَتْ وَصِباً بِاللَّمْسِ رَاحَتُهُ ۞ وَأَطْلَقَتْ أَرِباً مِنْ رِبْقَةِ اللَّمَمِ'
                                  '\n'
                                  'وَأَحْيَتِ السَّنَةَ الشَّهْبَاءَ دَعْوَتُهُ ۞ حَتَّى حَكَتْ غُرَّةً فِي الأَعْصُرِ الدُّهُمِ'
                                  '\n'
                                  'بِعَارِضٍ جَادَ أَوْ خِلْتَ البِطَاحَ بِهَا ۞ سَيْبٌ مِنَ اليَمِّ أَوْ سَيْلٌ مِنَ العَرِمِ'
                                  '\n',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                              '<<الفصل السادس>>'
                                  '\n'
                                  'دَعْنِي وَوَصْفِيَ آيَاتٍ لَهُ ظَهَرَتْ ۞ ظُهُورَ نَارِ القِرَى لَيْلاً عَلَى عَلَم'
                                  '\n'
                                  'فَالدُّرُّ يَزْداَدُ حُسْناً وَهُوَ مُنْتَظِمٌ ۞ وَلَيْسَ يَنْقُصُ قَدْراً غَيْرَ مُنْتَظِمِ'
                                  '\n'
                                  'فَمَا تَطَاوَلَ آمَالُ المَدِيحِ إلَى ۞ مَا فِيهِ مِنْ كَرَمِ الأخْلَاقِ وَالشِّيم'
                                  '\n'
                                  'آيَاتُ حَقٍّ مِنَ الرَّحْمَنِ مُحْدَثَةٌ ۞ قَدِيمَةٌ صِفَةُ المَوْصُوفِ بِالقِدَم'
                                  '\n'
                                  'لَمْ تَقْتَرِنْ بِزَمَانٍ وَهْيَ تُخْبِرُنَا ۞ عَنِ المَعَادِ وَعَنْ عَادٍ وَعَنْ إِرَم'
                                  '\n'
                                  'دَامَتْ لَدَيْنَا فَفَاقَتْ كُلَّ مُعْجِزَةٍ ۞ مِنَ النَّبِيِّينَ إذْ جَاءَتْ وَلَمْ تَدُمِ'
                                  '\n'
                                  'مُحَكَّمَاتٌ فَمَا تُبْقِينَ مِنْ شُبَهٍ ۞ لِذِى شِقَاقٍ وَمَا تَبْغِينَ مِنْ حَكَمِ'
                                  '\n'
                                  ' مَا حُورِبَتْ قَطُّ إلَّا عَادَ مِنْ حَرَبٍ ۞ أَعْدَى الأعَادِي إلَيْهَا مُلْقِيَ السَّلَمِ'
                                  '\n'
                                  'رَدَّتْ بَلَاغَتُهَا دَعْوَى مُعَارِضِهَا ۞ رَدَّ الغَيُورِ يَدَ الجَانِي عَنِ الحُرَمِ'
                                  '\n'
                                  'لَهَا مَعَانٍ كَمَوْجِ البَحْرِ فِي مَدَدٍ ۞ وَفَوْقَ جَوْهَرِهِ فِي الحُسْنِ وَالقِيَمِ'
                                  '\n'
                                  'فَمَا تُعَدُّ وَلَا تُحْصَى عَجَائِبُهَا ۞ وَلَا تُسَامُ عَلَى الإكْثَارِ بِالسَّأمِ'
                                  '\n'
                                  'قَرَّتْ بِهَا عَيْنُ قَارِيهَا فَقُلْتُ لَهُ ۞ لَقَدْ ظَفِرْتَ بِحَبْلِ اللَّهِ فَاعْتَصِمِ'
                                  '\n'
                                  'إِنْ تَتْلُهَا خِيفَةً مِنْ حَرِّ نَارِ لَظَى ۞ أَطْفَأتَ حَرَّ لَظَى مِنْ وِرْدِهَا الشَّبِمِ'
                                  '\n'
                                  'كَأَنَّهَا الحَوْضُ تَبْيَضُّ الوُجُوهُ بِهِ ۞ مِنَ العُصَاةِ وَقَدْ جَاؤُوهُ كَالحُمَمِ'
                                  '\n'
                                  'وَكَالصِّرَاطِ وَكَالمِيزَانِ مَعْدِلَةً ۞ فَالْقِسْطُ مِنْ غَيْرِهَا فِي النَّاسِ لَمْ يَقُمِ'
                                  '\n'
                                  'لَا تَعْجَبَنْ لِحَسُودٍ رَاحَ يُنْكِرُهَا ۞ تَجَاهُلاً وَهْوَ عَيْنُ الحَاذِقِ الفَهِمِ'
                                  '\n'
                                  'قَدْ تُنْكِرُ العَيْنُ ضَوْءَ الشَّمْسِ مِنَ رَمَدٍ ۞ وَيُنْكِرُ الفَمُ طَعْمَ المَاءِ مِنْ سَقَمِ'
                                  '\n'
                                  ,
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                              '<<الفصل السابع>>'
                                  '\n'
                                  'يَا خَيْرَ مَنْ يَمَّمَ العَافُونَ سَاحَتَهُ ۞ سَعْياً وَفَوْقَ مُتُونِ الأَيْنُقِ الرُّسُمِ'
                                  '\n'
                                  'وَمَنْ هُوَ الآيَةُ الكُبْرَى لِمُعْتَبِرٍ ۞ وَمَنْ هُوَ النِّعْمَةُ العُظْمَى لِمُغْتَنِمِ'
                                  '\n'
                                   'سَرَيْتَ مِنْ حَرَمٍ لَيْلاً إلَى حَرَمٍ ۞ كَمَا سَرَى البَدْرُ فِي دَاجٍ مِنَ الظُّلَمِ'
                                  '\n'
                                  'وَبِتَّ تَرْقَى إلَى أَنْ نِلْتَ مَنْزِلَةً ۞ مِنْ قَابِ قَوْسَيْنِ لَمْ تُدْرَكْ وَلَمْ تُرَمِ'
                                  '\n'
                                  'وَقَدَّمَتْكَ جَمِيعُ الأنْبِيَاءُ بِهَا ۞ وَالرُّسْل تَقْدِيمَ مَخْدُومٍ عَلَى خَدَمِ'
                                  '\n'
                                   'وَأَنْتَ تَخْتَرِقُ السَّبْعَ الطِّبَاقَ بِهِمْ ۞ فِي مَوْكِبٍ كُنْتَ فِيهِ صَاحِبَ العَلَمِ'
                                  '\n'
                                  'حَتَّى إذَا لَمْ تَدَعْ شَأواً لِمُسْتَبِقٍ ۞ مِنَ الدُّنُوِّ وَلَا مُرْقَى لِمُسْتَنِمِ'
                                  '\n'
                                  'خَفَضْتَ كُلَ مَقَامٍ بِالإضَافَةِ إذْ ۞ نُودِيتَ بِالرَّفْعِ مِثْلَ المُفْرَدِ العَلَمِ'
                                  '\n'
                                   'كَيْمَا تَفُوزَ بِوَصْلٍ أَيِّ مُسْتَتِرٍ ۞ عَنِ العُيُونِ وَسِرٍّ أَيِّ مُكْتَتَمِ'
                                  '\n'
                                  'فَحُزْتَ كُلَّ فَخَارٍ غَيْرَ مُشْتَرَكٍ  ۞ وَجُزْتَ كُلَّ مَقَامٍ غَيْرَ مُزْدَحَمِ'
                                  '\n'
                                  'وَجَلَّ مِقْدَارُ مَا وُلِّيْتَ مِنْ رُتَبٍ ۞ وَعَزَّ إدْرَاكُ مَا أُولِيتَ مِنْ نِعَمِ'
                                  '\n'
                                  'بُشْرَى لَنَا مِعْشَرَ الإسْلَامِ إنَّ لَنَا ۞ مِنَ العِنَايَةِ رُكْناً غَيْرَ مُنْهَدِمِ'
                                  '\n'
                                  'لَمَّا دَعَا اللَّهُ دَاعِينَا لِطَاعَتِهِ ۞ بِأَكْرَمِ الرُّسْلِ كُنَّا أَكْرَمَ الأمَمِ'
                                  '\n',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                              '<<الفصل الثامن>>'
                                  '\n'
                                  'رَاعَتْ قُلُوبَ العِدَا أَنْبَاءُ بِعْثَتِهِ ۞ كَنَبْأَةٍ أَجْفَلَتْ غُفْلاً مِنَ الغَنَمِ'
                                  '\n'
                                  'مَا زَالَ يَلْقَاهُمُ فِي كُلِّ مُعْتَرَكٍ ۞ حَتَّى حَكَوْا بِالقَنَا لَحْماً عَلَى وَضَمِ'
                                  '\n'
                                  'وَدُّوا الفِرَارَ فَكَادُوا يَغْبِطُونَ بِهِ ۞ أَشْلَاءَ شَالَتْ مَعَ العِقْبَانِ وَالرَّخَمِ'
                                  '\n'
                                  'تُمْضِي اللَّيَالِي وَلَا يَدْرُونَ عِدَّتَهَا ۞ مَا لَمْ تَكُنْ مِنْ لَيَالِي الأَشْهُرِ الحُرُمِ'
                                  '\n'
                                  'كَأنَّمَا الدِّينُ ضَيْفٌ حَلَّ سَاحَتَهُمْ ۞ بِكُلِّ قَرْمٍ إِلَى لَحْمِ العِدَا قَرِمِ'
                                  '\n'
                                  'يَجُرُّ بَحْرَ خَمِيسٍ فَوْقَ سَابِحَةٍ ۞ يَرْمِى بِمَوجٍ مِنَ الأبْطَالِ مُلْتَطِمِ'
                                  '\n'
                                  'مِنْ كُلِّ مُنْتَدِبٍ لِلَّهِ مُحْتَسِبٍ ۞ يَسْطُو بِمُسْتَأْصِلٍ لِلْكُفْرِ مُصْطَلِمِ'
                                  '\n'
                                  'حَتَّى غَدَتْ مِلَّةُ الإسْلَامِ وَهِيَ بِهِمْ ۞ مِنْ بَعْدِ غُرْبَتِهَا مَوْصُولَةَ الرَّحِمِ'
                                  '\n'
                                  'مَكْفُولَةً أَبَداً مِنْهُم بِخَيْرِ أَبٍ ۞ وَخَيْرِ بَعْلٍ فَلَمْ تَيْتَمْ وَلَمْ تَئِمِ'
                                  '\n'
                                  'هُمُ الجِبَالُ فَسَلْ عَنْهُم مُصَادِمَهُم ۞ مَاذَا رَأَى مِنْهُمُ فِي كُلِّ مُصْطَدِمِ'
                                  '\n'
                                  'وَسَلْ حُنَيْناً وَسَلْ بَدْراً وَسَلْ أُحُداً ۞ فُصُولُ حَتْفٍ لَهُم أَدْهَى مِنَ الوَخَمِ'
                                  '\n'
                                  'المُصْدِرِي البِيضُ حُمْراً بَعْدَ مَا وَرَدَتْ ۞ مِنَ العِدَا كُلَّ مُسْوَدٍّ مِنَ الِّلَمَمِ'
                                  '\n'
                                  'والكَاتِبِينَ بِسُمْرِ الخَطِّ مَا تَرَكَتْ ۞ أَقْلَامُهُم حَرْفَ جِسْمٍ غَيْرَ مُنْعَجِمِ'
                                  '\n'
                                  'شَاكِي السِّلَاحِ لَهُم سِيمَا تُمَيِّزُهُم ۞ وَالوَرْدُ يَمْتَازُ بِالسِّيمَا عَنِ السَّلَمِ'
                                  '\n'
                                  'تُهْدِى إلَيْكَ رِيَاحُ النَّصْرِ نَشْرَهُم ۞ فَتَحْسَبُ الزُّهْرَ فِي الأكْمَامِ كُلَّ كَمِ'
                                  '\n'
                                      'كَأنَّهُم فِي ظُهُورِ الخَيْلِ نَبْتُ رُباً ۞ مِنْ شِدَّةِ الحَزْمِ لَا مِنْ شِدَّةِ الحُزُم'
                                  '\n'
                                  'طَارَتْ قُلُوبُ العِدَا مِنْ بَأسِهِمْ فَرَقاً ۞ فَمَا تُفَرِّقُ بَيْنَ الْبَهْمِ والْبُهَمِ'
                                  '\n'
                                  'وَمَنْ تَكُنْ بِرَسُولِ اللَّهِ نُصْرَتُهُ ۞ إنْ تَلْقَهُ الأُسْدُ فِى آجَامِهَا تَجِمِ'
                                  '\n'
                                  'وَلَنْ تَرَى مِنْ وَلِيٍ غَيْرَ مُنْتَصِرٍ ۞ بِهِ وَلَا مِنْ عَدُوٍّ غَيْرَ مُنْفَصِمِ'
                                  '\n'
                                  'أَحَلَّ أُمَّتَهُ فِي حِرْزِ مِلَّتِهِ ۞ كَاللَّيْثِ حَلَّ مَعَ الأشْبَالِ فِي أَجَمِ'
                                  '\n'
                                  'كَمْ جَدَلَتْ كَلِمَاتُ اللَّهِ مِنْ جَدَلٍ ۞ فِيهِ وَكَمْ خَصَمَ البُرْهَانُ مِنْ خَصَمِ'
                                  '\n',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                              '<<الفصل التاسع>>'
                                  '\n'
                                  'خَدَمْتُهُ بِمَدِيحٍ أَسْتَقِيلُ بِهِ ۞ ذُنُوبَ عُمْرٍ مَضَى فِي الشِّعْرِ وَالخِدَمِ'
                                  '\n'
                                  'إِذْ قَلَّدَانِيَ مَا تُخْشَى عَوَاقِبُهُ ۞ كَأنَّنِي بِهِمَا هَدْيٌ مِنَ النَّعَمِ'
                                  '\n'
                                    'أَطَعْتُ غَيَّ الصِّبَا فِي الحَالَتَينِ وَمَا ۞ حَصَلْتُ إلَّا عَلَى الآثَامِ وَالنَّدَمِ'
                                  '\n'
                                  'فَيَا خَسَارَةَ نَفْسٍ فِي تِجَارَتِهَا ۞ لَمْ تَشْتَرِ الدِّينَ بِالدُّنْيَا وَلَمْ تَسُمِ'
                                  '\n'
                                  'وَمَنْ يَبِعْ آجِلاً مِنْهُ بِعَاجِلِهِ ۞ يَبِنْ لَهُ الْغَبْنُ فِي بَيْعٍ وَفِي سَلَمِ'
                                  '\n'
                                    'إنْ آتِ ذَنْباً فَمَا عَهْدِي بِمُنْتَقِضٍ ۞ مِنَ النَّبِيِّ وَلَا حَبْلِي بِمُنْصَرِمِ'
                                  '\n'
                                  'فَإنَّ لِي ذِمَّةً مِنْهُ بِتَسْمِيَتِي ۞ مُحَمَّداً وَهْوَ أَوْفَى الخَلْقِ بِالذِّمَمِ'
                                  '\n'
                                  'إِنْ لَمْ يَكُنْ فِي مَعَادِي آخِذاً بِيَدِى ۞ فَضْلاً وَإلَّا فَقُل يَا زَلَّةَ القَدَمِ'
                                  '\n'
                                    'حَاشَاهُ أَنْ يُحْرِمَ الرَاجِي مَكَارِمَهُ ۞ أَوْ يَرْجِعَ الجَارُ مِنْهُ غَيْرَ مُحْتَرَمِ'
                                  '\n'
                                  'وَمُنْذُ أَلْزَمْتُ أَفْكَارِي مَدَائِحَهُ ۞ وَجَدْتُهُ لِخَلَاصِي خَيْرَ مُلْتَزِمِ'
                                  '\n'
                                  'وَلَنْ يَفُوتَ الغِنَى مِنْهُ يَداً تَرِبَتْ ۞ إنَّ الحَيَا يُنْبِتُ الأزْهَارَ فِي الأَكَمِ'
                                  '\n'
                                   'وَلَمْ أُرِدْ زَهْرَةَ الدُّنْيَا الَّتِي اقْتَطفَتْ ۞ يَدَا زُهَيرٍ بِمَا أَثْنَى عَلَى هَرِمِ'
                                  '\n',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                              '<<الفصل العاشر>>'
                                  '\n'
                                  'يَا أَكْرَمَ الخَلْقِ مَا لِي مَنْ أَلُوذُ بِهِ ۞ سِوَاكَ عِنْدَ حُلُولِ الحَادِثِ العَمِمِ'
                                  '\n'
                                  'وَلَنْ يَضِيقَ رَسُولَ اللهِ جَاهُكَ بِي ۞ إذَا الكَرِيمُ تَحَلَّى بِاسْمِ مُنْتَقِمِ'
                                  '\n'
                                  'فَإنَّ مِنْ جُودِكَ الدُّنْيَا وَضَرَّتَهَا ۞ وَمِنْ عُلُومِكَ عِلْمَ اللَّوْحِ وَالقَلَمِ'
                                  '\n'
                                  'يَا نَفْسُ لَا تَقْنَطِي مِنْ زَلَّةٍ عَظُمَتْ ۞ إنَّ الكَبَائِرَ فِي الغُفْرَانِ كَاللَّمَمِ'
                                  '\n'
                                  'لَعَلَّ رَحْمَةَ رَبِّي حِينَ يَقْسِمُهَا ۞ تَأْتِي عَلَى حَسَبِ العِصْيَانِ فِي القِسَمِ'
                                  '\n'
                                  'يَارَبِّ وَاجْعَلْ رَجَائِي غَيْرَ مُنْعَكِسٍ ۞ لَدَيْكَ وَاجْعَلْ حِسَابِي غَيْرَ مُنْخَرِمِ'
                                  '\n'
                                  'وَالطُفْ بِعَبْدِكَ فِي الدَّارَينِ إنَّ لَهُ ۞ صَبْراً مَتَى تَدْعُهُ الأهْوَالُ يَنْهَزِمِ'
                                  '\n'
                                  'وَائْذَنْ لِسُحْبِ صَلَاةٍ مِنْكَ دَائِمَةٍ ۞ عَلَى النَّبِيِّ بِمُنْهَلٍّ وَمُنْسَجِمِ'
                                  '\n'
                                  'مَا رَنَّحَتْ عَذَبَاتِ البَانِ رِيحُ صَبَا ۞ وَأَطْرَبَ العِيسَ حَادِي العِيسِ بِالنَّغَمِ'
                                  '\n'
                                  'ثُمَّ الرِّضَا عَنْ أَبِي بَكْرٍ وَعَنْ عُمَرٍ ۞ وَعَنْ عَلِيٍّ وَعَنْ عُثْمَانَ ذِي الكَرَمِ'
                                  '\n'
                                  'وَالآلِ وَالصَّحْبِ ثمَّ التَّابعينَ فَهُم ۞ أَهْلُ التُّقَى وَالنَّقَا وَالحِلْمِ وَالكَرَمِ'
                                  '\n'
                                  'يَا رَبِّ بِالمِصْطَفَى بَلِّغْ مَقَاصِدَنَا ۞ وَاغْفِر لَنَا مَا مَضَى يَا وَاسِعَ الكَرَمِ'
                                  '\n'
                                  'وَاغْفِر إلَهِي لِكُلِّ المُسْلِمِينَ بِمَا ۞ يَتْلُوهُ فِي المَسْجِدِ الأقْصَى وَفِي الحَرَمِ'
                                  '\n'
                                  'بِجَاهِ مَنْ بَيْتُهُ فِي طَيْبَةٍ حَرَم ۞ وَإِسْمُهُ قَسَمٌ مِنْ أَعْظَمِ القَسَمِ'
                                  '\n'
                                  'وَهَذِهِ بُردَةُ المُخْتَارِ قَدْ خُتِمَتْ ۞ وَالحَمْدُ لِلَّهِ فِي بَدْءٍ وَفِي خَتَمِ'
                                  '\n'
                                   'أَبْيَاتُهَا قَدْ أَتَتْ سِتِّينَ مَعْ مِاَئةٍ ۞ فرِّجْ بِهَا كَرْبَنَا يَا وَاسِعَ الكَرَمِ'
                                  '\n',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  // Add more Card widgets as needed
                ],
              ),
            ),
          ],
        ),
      ),
    );
  }
}