import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class DetailPage5 extends StatelessWidget {
  final String imagePath;

  const DetailPage5({Key? key, required this.imagePath}) : super(key: key);

 @override
  Widget build(BuildContext context) {
    Color? appBarColor = Theme.of(context).brightness == Brightness.light
        ?  Color(0xFF4A5367) // Warna hijau untuk light mode
        : Theme.of(context).appBarTheme.backgroundColor; // Mengikuti warna dark mode

    Color textColor = Theme.of(context).brightness == Brightness.light
        ? Colors.black
        : Colors.white; // Text color for light mode and dark mode

    return Scaffold(

      appBar: AppBar(
        shape: RoundedRectangleBorder(
          borderRadius: BorderRadius.only(
            bottomLeft: Radius.circular(20),
            bottomRight: Radius.circular(20),
          ),
        ),
        title: Text(
          'Maulid Al-Habsyi',
          style: GoogleFonts.anton(fontSize: 20),
        ),
        centerTitle: true,
        backgroundColor: appBarColor,
        actions: [
          IconButton(
            icon: Icon(Icons.bookmark),
            onPressed: () {
              // Add your bookmark functionality here
            },

          ),
        ],
      ),

      body: Container(
        width: double.infinity,
        height: double.infinity,
        child: Stack(
          children: [
            SingleChildScrollView(
              child: Column(
                children: [
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          text: 'بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ \n',
                          style: GoogleFonts.scheherazadeNew(
                              color: textColor,
                              fontSize: 25,fontWeight: FontWeight.bold
                          ),
                          children: <TextSpan>[
                            TextSpan(
                              text: 'إِلَى حَضَرَةِ سَيِّدِنَا رَسُولِ اللهِ مُحَّمَدِبْنِ عَبْدِ الله وَأَنْصَارِ رَسُولِ اللهِ وَالْمُهَاجِرِينَ مَعَ رَسُوا اللَّهِ ثُمَّ إِلى رُوحِ سَيّدِنَا المُهَاجِرِ إِلَى اللَّهِ أَحْمَدَ اِبْنِ عِيسَى ثُمَّ إِِلَى رُوحِ سَيِّدِنَا الْفَقِيهِ الْمُقَدَّمِ مُحَّمَدِ بْنِ عَلِّى بَاعَلَوِى وَاُصُولِهِم وَفَرُوعِهِمْ.ثُمَّ إَلَى رُوحِ اَلْحَبِيْبِ عَلِّى بْنِ مُحَمَّد بِنْ حُسِيْنِ اَلْحَبَشِي وَوَالِدِينَا وَ وَالِدِيهِمْ وَأَمْوَاتِنَا وَأَمْوَاتِهِمْ وَأَمْوَاتِ الْمُسْلِمِينَ أَجْمَعِينَ وَاِلَى حَضْرَةِ النَّبِيِّ الْفَاتِحَة',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: 'اللَّهُمَّ صَلِّ وَسَلِّم وَبَارِكْ عَلَيْهِ وَعَلَى اَلِهِ'
                                  '\n'
                                  'فَياَ أَ يُّهَا الرَّاجُونَ مِنْهُ شَفَاعَة صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسِلِمَاوَيَا أَيُّهَا الْمُشْتَاقُونَ إِلَى رُؤْيَةِ جَمَالِة صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا.وَ يَا مَنْ يَخَطُبُ وِصَالَهً يَقَظَةً وَمَنَامًا'
                                  'صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيْمًاالْجَنَّةُ وَنَعِمُهَا سَعْدٌ لِمَنْ يُّصَلِّ وَيُوْسَلِّمُ وَيُبَارِكُ عَلَيْهِاَللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِك عَلَيْهِ وَعَلَى اللَّهُ',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: 'الصَّـلَاةُ الْاُوْلى\n'
                              'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ مَالَاحَ فِى الْاُفْقِ نُوْرُكَوْكَبْ'
                                  '\n'
                              'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَلْفَاتِحِ الْخَاتِمِ الْمُقَرَّبْ'
                              '\n'
                              'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَلْمُصْطَفَى الْمُجْتَبَى الْمُحَبَّب'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ مَالَاحَ بَدْرٌ وَغَابَ غَيْهَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞  مَارِيْحُ نَصْرٍبِالنَّصْرِ قَدْهَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّد ْ۞ مَاسَارَتِ الْعِيْسُ بَطْنَ سَبْسَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَكُلّ مَنْ لِلْحَبِيْبِ يُنْسَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَكُلّ مَنْ لِلنَّبِيّ يُصْحَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَاغْفِرْوَسَامِحْ مَنْ كَانَ اَذْنَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَبَلّغِ الْكُلَّ كُلَّ مُطْلَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَاسْلُكْ بِنَارَبّ خَيْرَ مَذْهَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَاصْلِحْ وَسَهّلْ مَاقَدْتَصَعَّبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَعْلَى الْبَرَايَاجَاهًاوَاَرْحَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَصْدَقِ عَبْدٍبِالْحَقّ اَعْرَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ خَيْرِالْوَرَى مَنْهَجًاوَأَصْوَبْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ مَاطَيْرُيُمْنٍ غَنَّى فَاَطْرَبْ',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: 'الصَّـلَاةُ الْثَانِيَةُ\n'
                              'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَشْرَفِ بَدْرٍفِى الْكَوْنِ اَشْرَقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَكْرَمِ دَاعٍ يَدْعُوْ اِلَى الْحَقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَلْمُصْطَفَى الصَّادِقِ الْمُصَدَّقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَحْلَى الْوَارَى مَنْطِقًاوَاَصْدَقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ اَفْضَلِ مَنْ بِالتُّقَى تَحَقَّقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ مَنْ بِالسَّخَاوَالْوَفَاتَخَلَّق'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَاجْمَعْ مِنَ الشَّمْلِ مَاتَفَرَّقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَاصْلِحْ وَسَهّلْ مَاقَدْتَعَوَّقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَافْتَحْ مِنَ الْخَيْرِكُلَّ مُغْلَقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَاَلِهِ وَمَنْ بِاٌلنَّبِيّ تَعَلَّقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَاَلِهِ وَمَنْ لِلْحَبِيْبِ يَعْشَقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ وَمَنْ بِحَبْلِ النَّبِيّ تَوَثَّقْ'
                                  '\n'
                                  'يَارَبِّ صَلِّ عَلى مُحَمَّدْ ۞ يَارَبّ صَلّ عَلَيْهِ وَسَلّمْ',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 24,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                      ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: 'اَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيم لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ'
                                  'مَا عَنِتُمْ حَرِيْصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَؤُوفُ رَّحِيْمُ . فَإِن تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَرَبُّ الْعَرْشِ الْعَظِيمُ . إِنَّ اللَّهَ وَمَلَئِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ، يَا اَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِمُوا تَسْلِيمًا. اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَى اَلِية',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                              'بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ\n'
                              '\n'
                              'اَلْحَمْدُلِلَّهِ الْقَوِيِّ سُلْطَانُه ﴿﴾ اَلْوَاضِحِ بُرْهَانُهْ ﴿﴾ اَلْمَبْسُوْطِ فِي الْوُجُوْدِ كَرَمُهُ وَاِحْسَانُه ﴿﴾ تَعَالَى مَجْدُهُ وَعَظُمَ شَانُهْ ﴿﴾ خَلَقَ الْخَلْقَ لِحِكْمَهْ ﴿﴾ وَطَوَى عَلَيْهَا عِلْمَهْ ﴿﴾ وَبَسَطَ لَهُمْ مِنْ فَآئِضِ الْمِنَّةِ مَا جَرَتْ بِهِ فِى اقْدَارِهِ الْقِسْمَةْ ﴿﴾ فَأَرْسَلَ إِلَيْهِمْ اَشْرَفَ خَلْقِهِ وَاَجَلَّ عَبِيْدِهِ رَحْمَة ﴿﴾ تَعَلَّقَتْ اِرَادَتُهُ الْأَزَلِيَّةُ بِخَلْقِ هَذَا الْعَبْدِ الْمَحْبُوْبِ ﴿﴾ فَانْتَشَرَتْ اَثَارُ شَرَفِهِ فِي عَوَالِمِ الشَّهَادَةِ وَالْغُيُوْبْ ﴿﴾ فَمَا اَجَلَّ هَذَا الْمَنَّ الَّذِيْ تَكَرَّمَ بِهِ الْمَنَّانْ ﴿﴾ وَمَا اَعْظَمَ هَذَا الْفَضْلَ الَّذِيْ بَرَزَ مِنْ حَضْرَةِ الْإِحْسَانْ ﴿﴾ صُوْرَةً كَامِلَةً ظَهَرَتْ فِي هَيْكَلٍ مَحْمُوْدْ ﴿﴾ فَتَعَطَّرَتْ بِوُجُوْدِهَا اَكْنَافُ الْوُجُوْدِ ﴿﴾ وَطَرَّزَتِ بُرْدَ الْعَوَالِمِ بِطِرَازِ التَّكْرِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                              'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                              '\n'
                              'تَجَلَّى الْحَقِّ فِي عَالِمِ قُدْسِهِ الْوَاسِعْ ﴿﴾ تَجَلِيًّا قَضَى بِإنْتِشَارِ فَضْلِهِ فِي الْقَرِيْبِ وَالشَّاسِعْ ﴿﴾ فَلَهُ الْحَمْدُ الَّذِيْ لَا تَنْحَصِرُ اَفْرَادُهُ بِتَعْدَادْ ﴿﴾ وَلَايُمَلُّ تَكْرَارُهُ بِكَثْرَةِ تَرْدَادْ ﴿﴾ حَيْثُ اَبْرَزَ مِنْ عَالَمِ الْآِمْكَانْ ﴿﴾ صُوْرَةَ هَذَا الْأِنْسَانْ ﴿﴾ لِيَتَشَرَّفَ بِوُجُوْدِهِ الثَّقَلاَنْ ﴿﴾ وَتَنْتَشِرَ اَسْرَارَهُ فِي الْأَكْوَانْ ﴿﴾ فَمَا مِنْ سِرٍّ اتَّصَلَ بِهِ قَلْبُ مُنِيْبْ ﴿﴾ اِلَّا مِنْ سَوَابِغِ فَضْلِ اللهِ عَلَى هَذَا الْحَبِيْب يَالَقَلْبٍ سُرُوْرُهُ قَدْ تَوَلَّى بِحَبِيْبٍ عَمَّ الْاَنَامَ نَوَالَا قَدْ تَرَقَّى فِى الْحُسْنِ اَعْلَى مَقَامٍ وَتَنَاهَى فِى مَجْدِهِ وَتَعَالَى لَا حَظَتْهُ الْعُيُوْنُ فِيمَا اجْتَلَتْهُ بَشَرًا كَامِلاً يُزِيْحُ الضَّلَالاَ جَلَّ مَنْ شَرَّفَ الْوُجُوْدَ بِنُوْرٍ غَمَرَ الْكَوْنَ بَهْجَةً وَجَمَالَا وَهْوَ مِنْ فَوْقِ عِلْمِ مَا قَدْ رَأَتْهُ رِفْعَةً فِى شُؤُوْنِهِ وَكَمَالَا  فَسُبْحَانَ الَّذِيْ اَبْرَزَ مِنْ حَضْرَةِ الْأِمْتِنَان ﴿﴾ مَا يَعْجِزُ عَنْ وَصْفِهِ اللِّسَانِ ﴿﴾ وَيَحَارُ فِي تَعَقُّلِ مَعَانِيْهِ الْجَنَان ﴿﴾ اِنْتَشَرَ مِنْهُ فِي عَالِمِ الْبُطُوْنِ وَالظُّهُوْر ﴿﴾ مَا مَلَاءَ الْوُجُوْدَ الْخَلْقِيَّ نُوْر ﴿﴾ فَتَبَارَكَ اللهُ مِنْ اِلَهٍ كَرِيْمٍ ﴿﴾ بَشَّرَتْنَا اَيَاتُهُ فِي الذِّكْرِ الْحَكِيْم ﴿﴾ بِبِشَارَةِ - لَقَدْ جَآءَكُمْ رَسُوْلٌ مِنْ اَنْفُسِكُم ﴿﴾ عَزِيْزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيْصٌ عَلَيْكُمْ بِالْمُؤْمِنِيْنَ رَؤُوْفٌ رَحِيْم ﴿﴾ فَمَنْ فَاجَأَتْهُ هَذِهِ الْبِشَارَةُ وَتَلَقَّاهَا بِقَلْبٍ سَلِيْم ﴿﴾ فَقَدْ هُدِيَ اِلَى صِرَاطٍ مُسْتَقِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'عَمَّا تَضَمَّنَهُ الْجِنَانْ ﴿﴾ مِنَ التَّصْدِيْقِ بِهَا وَالْاِذْعَانْ ﴿﴾ تَثْبُتُ بِهَا فِي الصُّدُوْرِ مِنَ الْإِيْمَانِ قَوَاعِدُه ﴿﴾ وَتَلُوْحُ عَلَى اَهْلِ الْيَقِيْنِ مِنْ سِرِّ ذَلِكَ الْأِذْعَانِ وَالتَّصْدِيْقِ شَوَاهِدُهُ ﴿﴾ وَاَشْهَدُ اَنَّ سَيِّدَنَا مُحَمَّداً الْعَبْدُ الصَّادِقَ فِي قَوْلِهِ وَفِعْلِهْ ﴿﴾ وَالْمُبَلِّغَ عَنِ اللهِ مَا اَمَرَهُ بِتَبْلِيْغِهِ لِخَلْقِهِ مِنْ فَرْضِهِ وَنَفْلِهْ ﴿﴾ عَبْدٌ اَرْسَلَهُ اللهُ لِلْعَالَمِيْنَ بَشِيْراً وَنَذِيْراً ﴿﴾ فَبَلَّغَ الرِّسَالَةْ ﴿﴾ وَاَدَّى الْأَمَانَةْ ﴿﴾ وَهَدَى اللهُ بِهِ مِنَ الْأُمَّةِ بَشَراً كَثِيْراً ﴿﴾ فَكَانَ فِي ظُلْمَةِ الْجَهْلِ لِلْمُسْتَبْصِرِيْنَ سِرَاجاً وَقَمَراً مُنِيْراً ﴿﴾ فَمَا اَعْظَمَهَا مِنْ مِنَّةٍ تَكَرَّمَ اللهُ بِهَا عَلَى الْبَشَرْ ﴿﴾ وَمَا اَوْسَعَهَا مِنْ نِعْمَةٍ اِنْتَشَرَ سِرُّهَا فِي الْبَحْرِ وَالْبَرْ ﴿﴾ اَللَّهُمَّ صَلِّ وَسَلِّمْ بِاَجَلِّ الصَّلَوَاتِ وَاَجْمَعِهَا وَاَزْكَى التَّحِيَّاتِ وَاَوْسَعِهَا ﴿﴾ عَلَى هَذَا الْعَبْدِ الَّذِيْ وَفَّى بِحَقِّ الْعُبُوْدِيَّةْ ﴿﴾ وَبَرَزَ فِيْهَا فِي خِلْعَةِ الْكَمَالْ ﴿﴾ وَقَامَ بِحَقِّ الرُّبُوْبِيَّةِ فِي مَوَاطِنِ الْخِدْمَةِ لِلَّهِ وَاَقْبَلَ عَلَيْهِ غَايَةَ الْإِقْبَالْ ﴿﴾ صَلَاةً يَتَّصِلُ بِهَا رُوْحُ الْمُصَلَّي عَلَيْهِ بِهِ ﴿﴾ فَيَنْبَسِطُ فِي قَلْبِهِ نُوْرُ سِرِّ تَعَلُّقِهِ بِهِ وَحُبِّهِ ﴿﴾ وَيُكْتَبُ بِهَا بِعِنَايَةِ اللهِ فِي حِزْبِه ﴿﴾ وَعَلَى اَلِهِ وَصَحْبِهِ اَلَّذِيْنَ ارْتَقَوْا صَهْوَةَ الْمَجْدِ بِقُرْبِهِ ﴿﴾ وَتَفَيَّأُوْا ظِلَالَ الشَّرَفَ الْأَصْلِيِّ بِوُدِّهِ وَحُبِّهِ ﴿﴾ مَا عَطَّرَ الْأَكْوَانَ بِنَشْرِ ذِكْرَاهُمْ نَسِيْ',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'اَمَّا بَعْدُ﴾ فَلَمَّا تَعَلَّقَتْ اِرَادَةُ اللهِ فِي الْعِلْمِ الْقَدِيْم ﴿﴾ بِظُهُوْرِ اَسْرَارِ التَّخْصِيْصِ لِلْبَشَرِ الْكَرِيْم ﴿﴾ بِالتَّقْدِيْمِ وَالتَّكْرِيْمِ ﴿﴾ نَفَذَتِ الْقُدْرَةُ الْبَاهِرَةْ ﴿﴾ بِالنِّعْمَةِ الْوَاسِعَةِ وَالْمِنَّةِ الْغَامِرَة ﴿﴾ فَانْفَلَقَتْ بَيْضَةُ التَّصْوِيْر ﴿﴾ فِي الْعَالَمِ الْمُطْلَقِ الْكَبِيْر ﴿﴾ عَنْ جَمَالٍ مَشْهُوْدٍ بِالْعَيْن ﴿﴾ حَاوٍ لِوَصْفِ الْكَمَالِ الْمُطْلَقِ وَاْلحُسْنِ التَّامِّ وَالزَّيْن ﴿﴾ فَتَنَقَّلَ ذَلِكَ الْجَمَالُ الْمَيْمُوْن ﴿﴾ فِي الْأَصْلَابِ الْكَرِيْمَةِ وَالْبُطُوْن ﴿﴾ فَمَا مِنْ صُلْبٍ ضَمَّة ﴿﴾ اِلَّا وَتَمَّتْ عَلَيْهِ مِنَ اللهِ النِّعْمَة ﴿﴾ فَهُوَ الْقَمَرُ التَّامُّ الَّذِيْ يَتَنَقَّلُ فِي بُرُوْجِهِ ﴿﴾ لِيَتَشَرَّفَ بِهِ مَوْطِنُ اسْتِقْرَارِهِ وَمَوْضِعُ خُرُوْجِهِ ﴿﴾ وَقَدْ قَضَتِ الْأَقْدَارُ الْأَزَلِيَّةُ بِمَا قَضَتْ وَاَظْهَرَتْ مِنْ سِرِّ هَذَا النُّوْرِ مَا اَظْهَرَت ﴿﴾ وَخَصَّصَتْ بِهِ مَنْ خَصَّصَتْ ﴿﴾ فَكَانَ مُسْتَقَرُّهُ فِي الْأَصْلَابِ الْفَاخِرَة ﴿﴾ وَالْأَرْحَامِ الشَّرِيْفَةِ الطَّاهِرَة ﴿﴾ حَتَّى بَرَزَ فِي عَالَمِ الشَّهَادَةِ بَشَراً لَا كَالْبَشَر ﴿﴾ وَنُوْراً حَيَّرَ الْأَفْكَارَ ظُهُوْرُهُ وَبَهَر ﴿﴾ فَتَعَلَّقَتْ هِمَّةُ الرَّاقِمِ لِهَذِهِ الْحُرُوْف ﴿﴾ بِأَنْ يَرْقُمَ فِي هَذَا الْقِرْطَاسِ مَاهُوَ لَدَيْهِ مِنْ عَجَائِبِ ذَلِكَ النُّوْرِ مَعْرُوْف ﴿﴾ وَإِنْ كَانَتِ الْأَلْسُنُ لَا تَفِيْ بِعُشْرِ مِعْشَارِ اَوْصَافِ ذَلِكَ الْمَوْصُوْف ﴿﴾ تَشْوِيْقاً لِلسَّامِعِيْن ﴿﴾ مِنْ خَوَاصِّ الْمُؤْمِنِيْن ﴿﴾ وَتَرْوِيْحاً لِلْمُتَعَلِّقِيْنَ بِهَذَا النُّوْرِ الْمُبِيْن ﴿﴾ وَاِلَّا فَاَنَّى تُعْرِبُ الْأَقْلَام ﴿﴾ عَنْ شُؤُوْنِ خَيْرِ الْأَنَام ﴿﴾ وَلَكِنْ هَزَّنيِ اِلَى تَدْوِيْنِ مَا حَفِظْتُهُ مِنْ سِيَرِ اَشْرَفِ الْمَخْلُوْقِيْن ﴿﴾ وَمَا اَكْرَمَهُ اللهُ بِهِ فِي مَوْلِدِهِ مِنَ الْفَضْلِ الَّذِي عَمَّ الْعَالَمِيْن ﴿﴾ وَبَقِيَتْ رَايَتُهُ فِي الْكَوْنِ مَنْشُوْرَةً عَلَى مَرِّ الْأَيَّامِ وَالشُّهُوْرِ وَالسِّنِيْن ﴿﴾ دَاعِي التَعَلُّقِ بِهَذِهِ الْحَضْرَةِ الْكَرِيْمَة ﴿﴾ وَلَاعِجُ التَّشَوُّقِ اِلَى سَمَاعِ اَوْصَافِهَا الْعَظِيْمَة ﴿﴾ وَلَعَلَّ اللهَ يَنْفَعُ بِهِ الْمُتَكَلِّمَ وَالسَّامِع ﴿﴾ فَيَدْخُلَانِ فِي شَفَاعَةِ هَذَا النَّبِيِّ الشَّافِع ﴿﴾ وَيَتَرَوَّحَانِ بِرُوْحِ ذَلِكَ النَّعِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'وَقَدْ آنَ لِلْقَلَمِ اَنْ يَخُطَّ مَا حَرَّكَتْهُ فِيْهِ الْأَنَامِلْ ﴿﴾ مِمَّا اسْتَفَادَهُ الْفَهْمُ مِنْ صِفَاتِ هَذَا الْعَبْدِ الْمَحْبُوْبِ الْكَامِل ﴿﴾ وَشَمَائِلِهِ الَّتِي هِيَ اَحْسَنُ الشَّمَائِل ﴿﴾ وَهُنَا حَسُنَ اَنْ نُثْبِتَ مَا بَلَغَ اِلَيْنَا فِي شَأْنِ هَذَا الْحَبِيْبِ مِنْ اَخْبَارٍ وَأَثَار ﴿﴾ لِيَتَشَرَّفَ بِكِتَابَتِهِ الْقَلَمُ وَالْقِرْطَاسُ وَتَتَنَزَّهَ فِي حَدَائِقِهِ الْأَسْمَاعُ وَالْأَبْصَار ﴿﴾ وَقَدْ بَلَغَنَا فِي الْأَحَادِيْثِ الْمَشْهُوْرَة ﴿﴾ أَنَّ اَوَّلَ شَيْءٍ خَلَقَهُ اللهُ هُوَ النُّوْرُ الْمُوْدَعُ فِي هَذِهِ الصُّوْرَة ﴿﴾ فَنُوْرُ هَذَا الْحَبِيْبِ اَوَّلُ مَخْلُوْقٍ بَرَزَ فِي الْعَالَم ﴿﴾ وَمِنْهُ تَفَرَّعَ الْوُجُوْدُ خَلْقاً بَعْدَ خَلْقٍ فِيْمَا حَدَثَ وَمَا تَقَادَم ﴿﴾ وَقَدْ اَخْرَجَ عَبْدُالرَّزَّاقِ بِسَنَدِهِ عَنْ جَابِرِ بْنِ عَبْدِاللهِ الْأَنْصَارِيِّ رَضِيَ اللهُ عَنْهُمَا قَالَ - قُلْتُ يَارَسُوْلَ اللهِ بِاَبِي وَاُمِّي اَخْبِرْنِي عَنْ اَوَّلِ شَيْءٍ خَلَقَهُ اللهُ قَبْلَ الْأَشْيَآء ﴿﴾ قَالَ يَاجَابِرُ إِنَّ اللهَ خَلَقَ قَبْلَ الْأَشْيَآءِ نُوْرَ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ نُوْرِه ﴿﴾ وَقَدْ وَرَدَ مِنْ حَدِيْثِ اَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ اَنَّهُ قَالَ ﴿﴾ قَالَ - رَسُوْلُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كُنْتُ اَوَّلَ النَّبِيِّيْنَ فِي الْخَلْقِ وَآخِرَهُمْ فِي الْبَعْثِ ﴿﴾ وَقَدْ تَعَدَّدَتِ الرِّوَايَاتُ بِاَنُّهُ اَوَّلُ الْخَلْقِ وُجُوْدًا وَاَشْرَفُهُمْ مَوْلُوْدًا ﴿﴾ وَلَمَّا كَانَتِ السَّعَادَةُ الْأَبْدِيَّة ﴿﴾ لَهَا مُلَاحَظَةٌ خَفِيَّةٌ اِخْتَصَّتْ منَ شَاءَتْ مِنَ الْبَرِيَّة ﴿﴾ بِكَمَالِ الْخُصُوْصِيَّة ﴿﴾ فَاسْتَوْدَعَتْ هَذَا النُّوْرَ الْمُبِيْن ﴿﴾ اَصْلَابَ وَبُطُوْنَ مِنْ شَرَّفَتْهُ مِنَ الْعَالَمِيْن ﴿﴾ فَتَنَقَّلَ هَذَا النُّوْرُ مِنْ صُلْبِ اَدَمَ وَنُوْحٍ وَ اَبْرَاهِيْم ﴿﴾ حَتَّى اَوْصَلَتْهُ يَدُ الْعِلْمِ الْقَدِيْم ﴿﴾ اِلَى مَنْ خَصَّصَتْهُ بِالتَّكْرِيْمِ اَبِيْهِ الْكَرِيْم ﴿﴾ عَبْدِاللهِ ابْنِ عَبْدِالْمُطَّلِبِ ذِيْ الْقَدْرِالْعَظِيْم ﴿﴾ وَاُمُّهُ الَتِي هِيَ فِي الْمُخَاوِفِ آمِنَة ﴿﴾ اَلسَّيِّدَةِ الْكَرِيْمَةِ اَمِنَة ﴿﴾ فَتَلَقَّاهُ صُلْبُ عَبْدُالله فَاَلْقَاهُ اِلَى بَطْنِهَا ﴿﴾ فَضَمَّتْهُ اَحْشَاؤُهَا بِمَعُوْنَةِ اللهِ مُحَافَظَةً عَلَى حَقِّ هَذِهِ الدُّرَّةِ وَصَوْنِهَا ﴿﴾ فَحَمَلَتْهُ بِرِعَايَةِ اللهِ كَمَا وَرَدَ عَنْهَا حَمْلاً خَفِيْفاً لَا تَجِدُ لَهُ ثِقَلاً ﴿﴾ وَلَا تَشْكُوْا مِنْهُ اَلَماً وَلَا عِلَلاً ﴿﴾ حَتَّى مَرَّ الشَّهْرُ بَعْدَ الشَّهْرِ مِنْ حَمْلِه ﴿﴾ وَقَرُبَ وَقْتُ بُرُوْزِهِ اِلَى عَالَمِ الشَّهَادَةِ لِتَنْبَسِطَ عَلَى اَهْلِ هَذَا الْعَالَمِ فَيُوْضَاتُ فَضْلِه ﴿﴾ وَتَنْتَشِرَ فِيْهِ اَثَارُ مَجْدِهِ الصَّمِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'وَمُنْذُ عَلِقَتْ بِهِ هَذِهِ الدُّرَّةُ الْمِكْنُوْنَة ﴿﴾ وَالْجَوْهَرَةُ الْمَصُوْنَة وَالْكَوْنُ كُلُّهُ يُصْبِحُ وَيُمْسِيْ فِي سُرُوْرٍ وَابْتِهَاج ﴿﴾ بِقُرْبِ ظُهُوْرِ اِشْرَاقِ هَذَا السِّرَاج ﴿﴾ وَالْعُيُوْنُ مُتَشَوِّفَةٌ اِلَى بُرُوْزِه ﴿﴾ مُتَشَوِّقَةٌ اِلَى الْتِقَاطِ جَوَاهِرِ كُنُوْزِه ﴿﴾ وِكُلُّ دَآبَّةٍ لِقُرَيْشٍ نَطَقَتْ بِفَصِيْحِ الْعِبَارَة ﴿﴾ مُعْلِنَةً بِكَمَالِ الْبِشَارَة ﴿﴾ وَمَا مِنْ حَامِلٍ حَمَلَتْ فِي ذَلِكَ الْعَام ﴿﴾ اِلَّا اَتَتْ فِي حَمْلِهَا بِغُلَام ﴿﴾ مِنْ بَرَكَاتِ وَسَعَادَةِ هَذَا الْأِمَام ﴿﴾ وَلَمْ تَزَلِ الْأَرْضُ وَالسَّمَوَات ﴿﴾ مُتَضَمَّخَةً بِعِطْرِ الْفَرَحِ بِمُلَاقَاةِ اَشْرَفِ الْبَرِيَّات ﴿﴾ وَبُرُوْزِهِ مِنْ عَالَمِ الْخَفَاءِ اِلَى عَالَمِ الظُّهُوْر ﴿﴾ بَعْدَ تَنَقُّلِهِ فِى الْبُطُوْنِ وَالظُّهُوْر ﴿﴾ فَاَظْهَرَاللهُ فِي الْوُجُوْدِ بَهْجَةَ التَّكْرِيْم ﴿﴾ وَبَسَطَ فِي الْعَالَمِ الْكَبِيْرِ مَائِدَةَ التَّشْرِيْفِ وَالتَّعْظِيْم ﴿﴾ بِبُرُوْزِ هَذَا الْبَشَرِالْكَرِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'فَحِيْنَ قُرَبَ اَوَانَ وَضْعِ هَذَا الْحَبِيْب ﴿﴾ اَعْلَنَتِ السَّمَوَاتُ وَالْأَرْضُوْنَ وَمَنْ فِيْهِنَّ بِالتَّرَحِيْب ﴿﴾ وَاَمْطَارُ الْجُوْدِ اْلاِلَهِيِّ عَلَى اَهْلِ الْوُجُوْدِ تَثِج ﴿﴾ وَاَلْسِنَةُ الْمَلَائِكَةِ بِالتَّبْشِيْرِ لِلْعَالَمِيْنَ تَعِج ﴿﴾سُبْحَانَ اللهِ وَالْحَمْدُلِلَّهِ وَلَااِلَهَ اِلَّااللهُ وَاللهُ اَكْبَر (ثلاثا) وَالْقُدْرَةُ كَشَفَتْ قِنَاعَ هَذَا الْمَسْتُوْر ﴿﴾ لِيَبْرُزَ نُوْرُهُ كَامِلًا فِي عَالَمِ الظُّهُوْر ﴿﴾ نُوْراً فَاقَ كُلَّ نُوْر ﴿﴾ وَاَنْفَذَالْحَقُّ حُكْمَه ﴿﴾ عَلَى مَنْ اَتَمَّ اللهُ عَلَيْهِ النِّعْمَة ﴿﴾ مِنْ خَوَاصِّ الْأُمَّة ﴿﴾ اَنْ يَحْضُرَ عِنْدَ وَضْعِهِ اُمَّةْ ﴿﴾ تَاْنِيْساً لِجَنَابِهَا الْمَسْعُوْد ﴿﴾ وَمُشَارَكَةً لَهَا فِي هَذَا السِّمَاطِ الْمَمْدُوْد ﴿﴾ فَحَضَرَتْ بِتَوْفِيْقِ اللهِ السَّيِّدَةُ مَرْيَمُ وَالسَّيِّدَةُ اَسِيَة ﴿﴾ وَمَعَهُمَا مِنَ الْحُوْرِالْعِيْنِ مَنْ قَسَمَ اللهُ لَهُ مِنَ الشَّرَفِ بِالْقِسْمَةِ الْوَافِيَة ﴿﴾ فَاَتَى الْوَقْتُ الَّذِيْ رَتَّبَ اللهُ عَلَى حُضُوْرِهِ وُجُوْدَ هَذَا الْمَوْلُوْد ﴿﴾ فَاَنْفَلَقَ صُبْحُ الْكَمَالِ مِنَ النُّوْرِ عَنْ عَمُوْد ﴿﴾ وَبَرَزَ الْحَامْدُ الْمَحْمُوْد ﴿﴾ مُذْعِناً لِلَّهِ بِالتَّعْظِيْمِ وَالسُّجُوْ',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                                  '\nمَحْلُ الْقِيَام'
                                  '\n'
                                      '\n'
                              'اَشْـرَقَ الْكَوْنُ ابْـتِـهَاجَــا بِوُجُوْدِ الْمُصْطَفَى اَحْمَـدْ'
                                      '\n'
                                      '\n'
                                      'وَلِاَهْلِ الْكَـوْنِ اُنْــــسُ وَسُرُوْرٌ قَـدْ تَـجَـدَّدْ'
                                      '\n'
                                      '\n'
                                      'فَاطْـرَبُـوْا يَااَهْلَ الْمَثَانِـي فَهَـزَارُ الْيُـمْنِ غَـرَّدْ'
                                      '\n'
                                      '\n'
                                      'وَاسْتَضِيْؤُا بِـجَـمَـالِ فَاقَ فِى الْحُسْنِ تَـفَـرَّدْ'
                                      '\n'
                                      '\n'
                                      'وَلَنَا الْـبُـشْرَى بِـسَـعْدٍ مُسْـتَـمِرٍ لَيـْـسَ يَنْـفَــدْ'
                                      '\n'
                                      '\n'
                                      'حَيْثُ اُوْتِــيـْنـَا عَـطَاءَ جَمَعَ الْـفَـخْرَالـْمُــؤَبَّـدْ'
                                      '\n'
                                      '\n'
                                      'فَـلِرَبِّــي كُلُّ حَـمْدٍ جَلَّ اَنْ يَـحـْصُرَهُ الْعَدْ'
                                      '\n'
                                      '\n'
                                      'اِذْحَبَـانَابِوُجُوْدِ الــــْ مُصْطَفـَى الْهَادِي مُحَمَّدْ'
                                      '\n'
                                      '\n'
                                      'يَارَسُوْلَ اللهِ اَهْـــلًا بِكَـ اِنَـا بِكَـ نُسْـعَـدْ'
                                      '\n'
                                      '\n'
                                      'وَبِـجَاهِه يَـااِلَهِـي جُدْوَبَلِّغْ كُلَّ مَقْـصَدْ'
                                      '\n'
                                      '\n'
                                      'وَاهْدِنَانَهْجَ سَبِــيْلِه كَـيْ بِـــهِ نُسْـعَدْ وَنُرْشَدْ'
                                      '\n'
                                      '\n'
                                      'رَبِّ بَلِّـغْنَا بِـجَاهِه فِـى جِوَارِه خَيْرَ مَقْعَدْ'
                                      '\n'
                                      '\n'
                                      'وَصَلَاةُ اللهِ تَغْـشَـى اَشْرَفَ الرُّسْلِ مُـحَـمَّــدْ'
                                      '\n'
                                      '\n'
                                      'وَسَــلَامٌ مُسْتَــمِرٌّ كُلَّ حِيْنٍ يَـــتَــجَــدَّدْ',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                 'وَحِيْنَ بَرَزَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ بَطْنِ اُمِّهِ بَرَزَ رَافِعاً طَرْفَهُ اِلَى السَّمَآءُ ﴿﴾ مُؤْمِياًبِذَلِكَ الرَّفْعِ اِلَى اَنَّ لَهُ شَرَفاً عَلَا مَجْدُهُ وَسَمَا ﴿﴾ وَكَانَ وَقْتُ مَوْلِدِ سَيِّدِ الْكَوْنَيْن ﴿﴾ مِنَ الشُّهُوْرِ شَهْرُ رَبِيْعِ الْأَوَّلِ وَمِنَ الْأَيَّامِ يَوْمَ الْأِثْنَيْن ﴿﴾ وَمَوْضِعُ وِلَادَتِهِ وَقَبْرِهِ بِالْحَرَمَيْن ﴿﴾ وَقَدْ وَرَدَ اَنَّهُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وُلِدَ مَخْتُوْناً مَكْحُوْلاً مَقْطُوْعَ السُّرَّة ﴿﴾ تَوَلَّتْ ذَلِكَ لِشَرَفِهِ عِنْدَ اللهِ اَيْدِي الْقُدْرَة ﴿﴾ وَمَعَ بُرُوْزِهِ اِلَى هَذَا الْعَالَمِ ظَهَرَ مِنَ الْعَجَائِب ﴿﴾ مَايَدُلُّ عَلَى اَنَّهُ اَشْرَفُ الْمَخْلُوْقِيْنَ وَاَفْضَلُ الْحَبَائِب ﴿﴾ فَقَدْ وَرَدَ عَنْ عَبْدِالرَّحْمَنِ بْنِ عَوْفٍ عَنْ اُمِّهِ الشَّفَّاءِ رَضِيَ اللهُ عَنْهُمَا ﴿﴾ قَالَتْ لَمَّا وَلَدَتْ اَمِنَةُ رَضِيَ اللهُ عَنْهَا رَسُوْلَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَعَ عَلَى يَدَيَّ فَا سْتَهَلَّ فَسَمِعْتُ قَائِلاً يَقُوْلُ رَحِمَكَ اللهُ اَوْ رَحِمَكَ رَبُّكَ ﴿﴾ قَالَتِ الشَّفَّاءُ فَاَضَآءَ لَهُ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِب ﴿﴾ حَتَّى نَظَرْتُ اِلَى بَعْضِ قُصُوْرِ الرُّوْمِ ﴿﴾ قَالَتْ ثُمَّ اَلْبَسْتُهُ وَاَضْجَعْتُهُ فَلَمْ اَنْشَبْ عَنْ غَشِيَتْنِى ﴿﴾ فَسَمِعْتُ قَائِلًا يَقُوْلُ اَيْنَ ذَهَبْتَ بِهِ قَالَ اِلَى الْمَغْرِبِ ﴿﴾ وَاَسْفَرَ ذَالِكَ عَنِّي ﴿﴾ ثُمَّ عَاوَدَنِي الرُّعْبُ وَظُلْمَةُ وَالْقُشَعْرَيْرَةُ عَنْ يَسَارِي ﴿﴾ فَسَمِعْتُ قَائِلًا يَقُوْلُ اَيْنَ ذَهَبْتَ بِهِ قَالَ اِلَى الْمَشْرِقِ ﴿﴾ قَالَتْ فَلَمْ يَزَالِ الْحَدِيْثُ مِنِّي عَلَى بَالٍ حَتَّى ابْتَعَثَهُ اللهُ ﴿﴾ فَكُنْتُ مِنْ اَوَّالٍ النَّاسِ اِسْلَامًا ﴿﴾ وَكَمْ تَرْجَمْتِ السُّنَّةُ مِنْ عَظِيْمِ الْمُعْجِزَات ﴿﴾ وَبَاهِرِ الْاَيَاتِ الْبَيِّنَات ﴿﴾ بِمَا يَقْضِي بِعَظِيْمِ شَرَفِهِ عِنْدَ مَوْلَاه ﴿﴾ وَأَنَّ عَيْنَ عِنَايَتِهِ فِي كُلِّ حِيْنٍ تَرْعَاه ﴿﴾ وَاَنَّهُ الْهَاِدي اِلَى الصِّرَاطِ الْمُسْتَقِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'ثُمَّ اِنَّهُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ اَنْ حَكَمَتِ الْقُدْرَةُ بِظُهُوْرِه ﴿﴾ وَاَنْتَشَرَتْ فِي الْأَكْوَانِ لَوَامِعُ نُوْرِه ﴿﴾ تَسَابَقَتْ اِلَى رَضَاعِهِ الْمُرْضِعَات ﴿﴾ وَتَوَفَّرَتْ رَغَبَاتُ اَهْلِ الْوُجُوْدِ فِي حَضَانَةِ هَذِهِ الذَّات ﴿﴾ فَنَفَذَ الْحُكْمُ مِنَ الْحَضْرَةِ الْعَظِيْمَة ﴿﴾ بِوَاسِطَةِ السَّوَابِقِ الْقَدِيْمَة ﴿﴾ بِأَنَّ الْأَوْلَى بِتَرْبِيَةِ هَذَا الْحَبِيْبِ وَحَضَانَتِهِ السَّيِّدَةُ حَلِيْمَة ﴿﴾ وَحِيْنَ لَاحَظَتْهُ عُيُوْنُهَا ﴿﴾ وَبَرَزَ فِي شَأْنِهَا مِنْ اَسْرَارِ الْقُدْرَةِ الرَّبَّانِيَّةِ مَكْنُوْنُهَا ﴿﴾ نَازَلَ قَلْبَهَا مِنَ الْفَرَحِ وَالسُّرُوْر ﴿﴾ مَا دَلَّ عَلَى اَنَّ حَظَهَا مِنَ الْكَرَامَةِ عِنْدَ اللهِ حَظٌّ مَوْفُوْر ﴿﴾ فَحَنَتْ عَلَيْهِ حُنُوَّ الْأُمَّهَاتِ عَلَى الْبَنِيْن ﴿﴾ وَرَغِبَتْ فِي رَضَاعِهِ طَمَعاً فِي نَيْلِ بَرَكَاتِهِ الَّتِي شَمِلَتِ الْعَالَمِيْن ﴿﴾ فَطَلَبَتْ مِنْ اُمِّهِ الْكَرِيْمَة ﴿﴾ اَنْ تَتَوَلَّى رَضَاعَهُ وَحَضَانَتَهُ وَتَرْبِيَتَهُ بِالْعَيْنِ الرَّحِيْمَة ﴿﴾ فَأَجَابَتْهَا بِالتَّلْبِيَةِ لِدَاعِيْهَا ﴿﴾ لِمَا رَأَتْ مِنْ صِدْقِهَا فِي حُسْنِ التَّرْبِيَّةِ وَوُفُوْرِ دَوَاعِيْهَا ﴿﴾ فَتَرَحَّلَتْ بِهِ اِلَى مَنَازِلِهَا مَسْرُوْرَة ﴿﴾ وَهِيَ بِرِعَايَةِ اللهِ مَحْفُوْفَةٌ وَبَعَيْنِ عِنَايَتِهِ مَنْظُوْرَة ﴿﴾ فَشَاهَدَتْ فِي طَرِيْقِهَا مِنْ غَرِيْبِ الْمُعْجِزَات ﴿﴾ مَا دَلَّهَا عَلَى اَنَّهُ اَشْرَفُ الْمَخْلُوْقَات ﴿﴾ فَقَدْ اَتَتْ وَشَارِفُهَا وَاَتَانُهَا ضَعِيْفَتَان ﴿﴾ وَرَجَعَتْ وَهُمَا لِدَوَابِّ الْقَافِلَةِ يَسْبِقَان ﴿﴾ وَقَدْ دَرَتِ الشَّارِفُ وَالشِّيَاةُ مِنَ الْأَلْبَان ﴿﴾ بِمَا حَيِّرَ الْعُقُوْلَ وَالْأَذْهَان ﴿﴾ وَبَقِيَ عِنْدَهَا فِي حَضَانَتِهَا وَزَوْجِهَا سَنَتَيْن ﴿﴾ تَتَلَقَّى مِنْ بَرَكَاتِهِ وَعَجَائِبِ مُعْجِزَاتِهِ مَا تَقَرُّ بِهِ الْعَيْن ﴿﴾ وَتَنْتَشِرُ اَسْرَارُهُ فِي الْكَوْنَيْن ﴿﴾ حَتَّى وَاجَهَتْهُ مَلَائِكَةُ التَّخْصِيْصِ وَالْأِكْرَام ﴿﴾ بِالشَّرَفِ الَّذِيْ عَمَّتْ بَرَكَتُهُ الْأَنَام ﴿﴾ وَهُوَ يَرْعَى الْأَغْنَام ﴿﴾ فَاضْجَعُوْهُ عَلَى الْأَرْضِ اِضْجَاعَ تَشْرِيْفِ ﴿﴾ وَشَقُّوْا بَطْنَهُ شَقّاً لَطِيْف ﴿﴾ ثُمَّ اَخْرَجُوْا مِنْ قَلْبِهِ مَا اَخْرَجُوْهُ وَاَوْدَعُوْا فِيْهِ مِنْ اَسْرَارِ الْعِلْمِ وَ الْحِكْمَةِ مَا اَوْدَعُوْه ﴿﴾وَمَا اَخْرَجَ الْاَمْلَكُ مِنْ قَلْبِهِ اَدًى ﴿﴾ وَلَكِنَّهُمْ زَادُهُ طُهْرًا عَلَى طُهْرِ وَهُوَ مَعَ ذَلِكَ فِي قُوَّةٍ وَثَبَات ﴿﴾ يَتَصَفَّحُ مِنْ سُطُوْرِ الْقُدْرَةِ الْاِلَهِيَّةِ بَاهِرَ الْاَيَات ﴿﴾ فَبَلَغَ اِلَى مُرْضِعَتِهِ الصَّالِحَةِ الْعَفِيْفَة ﴿﴾ مَا حَصَلَ عَلَى ذَاتِهِ الشَّرِيْفَة ﴿﴾ فَتَخَوَّفَتْ عَلَيْهِ مِنْ حَادِثٍ تَخْشَاه ﴿﴾ وَلَمْ تَدْرِ اَنَّهُ مُلَاحَظٌ بِالْمُلَاحَظَةِ التَّامَّةِ مِنْ مَوْلَاهُ ﴿﴾ فَرَدَّتْهُ اِلَى اُمِّهِ وَهِيَ غَيْرُ سَخِيّةٍ بِفِراَقِه ﴿﴾ وَلَكِنْ لِمَا قَامَ مَعَهَا مِنْ حُزْنِ الْقَلْبِ عَلَيْهِ وَاِشْفَاقِه ﴿﴾ وَهُوَ بِحَمْدِاللهِ فِي حِصْنٍ مَانِعٍ وَمَقَامٍ كَرِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),

                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'فَنَشَاءَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى اَكْمَلِ الْأَوْصَاف ﴿﴾ يَحُفُّهُ مِنَ اللهِ جَمِيْلُ الرِّعَايَةِ وَغَامِرُ الْأَلْطَاف ﴿﴾ فَكَانَ يَشِبُّ فِي الْيَوْمِ شَبَابَ الصَّبِيِّ فيِ الشَّهْرِ ﴿﴾ وَيَظْهَرُ عَلَيْهِ فِي صِبَاهُ مِنْ شَرَفِ الْكَمَالِ مَا يَشْهَدُ لَهُ بِأَنَّهُ سَيِّدُ وَلَدِ آدَمَ وَلَا فَخر ﴿﴾ وِلَمْ يَزَلْ وَاَنْجُمُ سُعُوْدِهِ طَالِعَة ﴿﴾ وَالْكَائِنَاتُ لِعَهْدِهِ حَافِظَةٌ وَلِاَمْرِهِ طَائِعَة ﴿﴾ فَمَا نَفَثَ عَلَى مَرِيْضٍ اِلَّا شَفَاهُ الله ﴿﴾ وَلَاتَوَجَّهَ فِي غَيْثٍ اِلَّا وَاَنْزَلَهُ مَوْلَاه ﴿﴾ حَتَّى بَلَغَ مِنَ الْعُمْرِ اَشُدَّه ﴿﴾ وَمَضَتْ لَهُ مِنْ سِنِّ الشَّبَابِ وَالْكُهُوْلَةِ مُدَّة ﴿﴾ فَاجَأَتْهُ الْحَضْرَةُ الْاِلَهِيَّةُ بِمَا شَرَّفَتْهُ بِهِ وَحْدَه ﴿﴾ فَنَزَلَ عَلَيْهِ الرُّوْحُ الْأَمِيْن ﴿﴾ بِالْبُشْرَى مِنْ رَبِّ الْعَالَمِيْن ﴿﴾ فَتَلَا عَلَيْهِ لِسَانُ الذِّكْرِ الْحَكِيْمِ شَاهِدَ ﴿ وَاِنَّكَ لَتُلَقَّى الْقُرْآنَ مِنْ لَدُنْ حَكِيْمٍ عَلِيْم ﴾ فَكَانَ اَوَّلَ مَا نَزَلَ عَلَيْهِ مِنْ تِلْكَ الْحَضْرَةِ مِنْ جَوَامِعِ الْحِكَم ﴿﴾ قَوْلُهُ تَعَالَى : ﴿ اِقْرَأ بِاسْمِ رَبِّكَ الَّذِيْ خَلَق ﴿﴾ خَلَقَ الْأِنْسَانَ مِنْ عَلَق ﴿﴾ اِقْرَأ وَرَبُّكَ الْأَكْرَم ﴿﴾ اَلَّذِيْ عَلَّمَ بِالْقَلَم ﴿﴾ عَلَّمَ الْأِنْسَانَ مَا لَمْ يَعْلَم ﴾ فَمَا اَعْظَمَهَا مِنْ بِشَارَةٍ اَوْصَلَتْهَا يَدُ الْأِحْسَان ﴿﴾ مِنْ حَضْرَةِ الْأِمْتِنَان ﴿﴾ اِلَى هَذَا الْأِنْسَان ﴿﴾ وَاَيَّدَتْهَا بِشَارَةُ ﴿ اَلرَّحْمَنُ عَلَّمَ الْقُرْآن ﴿﴾ خَلَقَ الْاِنْسَانَ عَلَّمَهُ الْبَيَان ﴾ وَلَاشَكَّ اَنَّهُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ هُوَ الْأِنْسَانُ الْمَقْصُوْدُ بِهَذَا التَّعْلِيْم ﴿﴾ مِنْ حَضْرَةِالرَّحْمَنِ الرَّحِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),

                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'ثُمَّ اِنَّهُ بَعْدَ مَا نَزَلَ عَلَيْهِ الْوَحْيُ الْبَلِيْغ ﴿﴾ تَحَمَّلْ اَعْبَاءَ الدَّعْوَةِ وَالتَّبْلِيْغ ﴿﴾ فَدَعَا الْخَلْقَ اِلَى اللهِ عَلَى بَصِيْرَةِ ﴿﴾ فَاَجَابَهُ بِالْاِذْعَانِ مَنْ كَانَتْ لَهُ بَصِيْرَةٌ مُنِيْرَة ﴿﴾ وَهِيَ اِجَابَةٌ سَبَقَتْ بِهَا الْأَقْضِيَةُ وَالْأَقْدَار ﴿﴾ تَشَرَّفَ بِالسَّبْقِ اِلَيْهَا الْمُهَاجِرُوْنَ وَالْاَنْصَار ﴿﴾ وَقَدْ اَكْمَلَ اللهُ بِهِمَّةِ هَذَا الْحَبِيْبِ وَاَصْحَابِهِ هَذَا الدِّيْن ﴿﴾ وَاَكْبَتَ بِشِدَّةِ بَأْسِهِمْ قُلُوْبَ الْكَافِرِيْنَ وَالْمُلْحِدِيْن ﴿﴾ فَظَهَرَ عَلَى يَدَيْهِ مِنْ عَظِيْمِ الْمُعْجِزَات ﴿﴾ مَا يَدُلُّ عَلَى اَنَّهُ اَشْرَفُ اَهْلِ الْأَرْضِ وَالسَّمَوَات ﴿﴾ فَمِنْهَا تَكْثِيْرُ الْقَلِيْل ﴿﴾ وَبُرْءُ الْعَلِيْل ﴿﴾ وَتَسْلِيْمُ الْحَجَر ﴿﴾ وَطَاعَةُ الشَّجَر ﴿﴾ وَانْشِقَاقُ الْقَمَر ﴿﴾ وَالْخِبَارُ بِالْمُغَيَّبَات ﴿﴾ وَحَنِيْنُ الْجِذْعِ الَّذِيْ هُوَ مِنْ خَوَارِقِ الْعَادَات ﴿﴾ وَشَهَادَةُ الضَبِّ لَهُ وَالْغَزَالَة ﴿﴾ بِالنُّبُوَّةِ وَالرِّسَالَة ﴿﴾ اِلَى غَيْرِ ذَلِكَ مِنْ بَاهِرِ الْآيَات ﴿﴾ وَغَرَائِبِ الْمُعْجِزَات ﴿﴾ اَلَّتِيْ اَيَّدَهُ اللهُ بِهَا فِي رِسَالَتِه ﴿﴾ وَخَصَّصَهُ بِهَا مِنْ بَيْنِ بَرِيَّتِه ﴿﴾ وَقَدْ تَقَدَّمَتْ لَهُ قَبْلَ النُّبُوَّةِ اِرْهَاصَات ﴿﴾ هِيَ عَلَى نُبُوَّتِهِ وَرِسَالَتِهِ مِنْ اَقْوَى الْعَلَامَات ﴿﴾ وَمَعَ ظُهُوْرِهَا وَانْتِشَارِهَا سَعِدَ بِهَا الصَّادِقُوْنَ مِنَ الْمُؤْمِنِيْن ﴿﴾ وَشَقِيَ بِهَا الْمُكَذِّبُوْنَ مِنَ الْكَافِرِيْنَ وَالْمُنَافِقِيْن ﴿﴾ وَتَلَقَّاهَا بِالتَّصْدِيْقِ وَالتَّسْلِيْم ﴿﴾ كُلُّ ذِيْ قَلْبٍ سَلِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),

                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'وِمِنَ الشَّرَفِ الَّذِيْ اَخْتَصَّ اللهُ بِهِ اَشْرَفَ رَسُوْل ﴿﴾ مِعْرَاجُهُ اِلَى حَضْرَةِ اللهِ الْبَّرِ الْوَصُوْل ﴿﴾ وَظُهُوْرُ اَيَاتِ اللهِ الْبَاهِرَةِ فِي ذَلِكَ الْمِعْرَاج ﴿﴾ وَتَشَرُّفُ السَّمَوَاتِ وَمَنْ فَوْقَهُنَّ بِاِشْرَاقِ نُوْرِ ذَلِكَ السِّرَاج ﴿﴾ فَقَدْ عَرَجَ الْحَبِيْبُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ الْاَمِيْنُ جِبْرِيْل ﴿﴾ اِلَى حَضْرَةِ الْمَلِكِ الْجَلِيْل ﴿﴾ مَعَ التَّشْرِيْفِ وَالتَّبْجِيْل ﴿﴾ فَمَا مِنْ سَمَآءٍ وَلَجَهَا اِلَّا وَبَادَرَهُ اَهْلُهَا بِالتَّرْحِيْبِ وَالتَّكْرِيْمِ وَالتَّأْهِيْل ﴿﴾ وَكُلُّ رَسُوْلٍ مَرَّ عَلَيْهِ ﴿﴾ بَشَرَهُ بِمَا عَرَفَهُ مِنْ حَقِّهِ عِنْدَ اللهِ وَشَرِيْفِ مَنْزِلَتِهِ لَدَيْه ﴿﴾ حَتَّى جَاوَزَ السَّبْعَ الطِّبَاق ﴿﴾ وَوَصَلَ اِلَى حَضْرَةِ الْأِطْلَاق ﴿﴾ نَازَلَتْهُ مِنَ الْحَضْرَةِ الْاِلَهِيَّة ﴿﴾ غَوَامِرٌ النَّفَحَاتِ الْقُرْبِيَّة ﴿﴾ وَوَاجَهَتْهُ بِالتَّحِيَّات ﴿﴾ وَاَكْرَمَتْهُ بِجَزِيْلِ الْعَطِيَّات ﴿﴾ وَاَوْلَتْهُ جَمِيْلَ الْهِبَاتْ ﴿﴾ وَنَادَتْهُ بِشَرِيْفِ التَّسْلِيْمَات ﴿﴾ بَعْدَ اَنْ اَثْنَى عَلَى تِلْكَ الْحَضْرَةِ بِالتَّحِيَّاتِ الْمُبَارَكَاتِ الصَّلَوَاتِ الطِّيِّبَات ﴿﴾ فَيَالَهَا مِنْ نَفَحَاتٍ غَامِرَات ﴿﴾ وَتَجَلِّيَاتٍ عَالِيَاتٍ فِي حَضْرَاتٍ بَاهِرَات ﴿﴾ تَشْهَدُ فِيْهَا الذَّاتُ لِلذَّات ﴿﴾ وَتَتَلَّقَى عَوَاطِفَ الرَّحْمَات ﴿﴾ وَسَوَابِغَ الْفُيُوْضَاتِ بِأَيْدِيْ الْخُضُوْعِ وَالْأِخْبَات رُتَبٌ تَسْقُطُ الْاَمَانِيُّ حَسْرَى ﴿﴾ دُوْنَهَا مَا وَرَآءَ هُنَّ وَرَآءُعَقَلَ الْحَبِيْبُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي تِلْكَ الْحَضْرَةِ مِنْ سِرِّهَا مَا عَقَل ﴿﴾ وَاتَّصَلَ مِنْ عِلْمِهَا بِمَا اتَّصَل ﴿﴾ فَاَوْحَى اِلَى عَبْدِهِ مَا اَوْحَى ﴿﴾ مَا كَذَبَ الْفُؤَادُ مَا رَأَى ﴿﴾ فَمَا هِيَ اِلَّا مِنْحَةٌ خَصَّصَتْ بِهَا حَضْرَةُ الْأِمْتِنَان ﴿﴾ هَذَا الْاِنْسَان ﴿﴾ وَاَوْلَتْهُ مِنْ عَوَاطِفِهَا الرَّحِيْمَةِ مَا يَعْجِزُ عَنْ حَمْلِهِ الثَّقَلَان ﴿﴾ وَتِلْكَ مَوَاهِبُ لَا يَجْسُرُ الْقَلَمُ عَلَى شَرِحِ حَقَائِقِهَا ﴿﴾ وَلَاتَسْتَطِيْعُ الْأَلْسُنُ اَنْ تُعْرِبَ عَنْ خَفِيِّ دَقَائِقِهَا ﴿﴾ خَصَّصَتْ بِهَا الْحَضْرَةُ الْوَاسِعَة ﴿﴾ هَذِهِ الْعَيْنَ النَّاظِرَةَ وَالْأُذُنَ السَّامِعَة ﴿﴾ فَلَا يَطْمَعُ طَامِعٌ فِي الْأِطَّلَاعٍ عَلَى مَسْتُوْرِهَا ﴿﴾ وَالْأِحَاطَةِ بِشُهُوْدِ نُوْرِهَا ﴿﴾ فَإِنَّهَا حَضْرَةٌ جَلَتْ عَنْ نَظَرِ النَّاظِرِيْن ﴿﴾ وَرُتْبَةٌ عَزَّتْ عَلَى غَيْرِ سَيِّدِ الْمُرْسَلِيْن ﴿﴾ فَهَنِّيْئاً لِلْحَضْرَةِ الْمُحَمَّدِيَّة ﴿﴾ مَا وَاجَهَهَا مِنْ عَطَايَا الْحَضْرَةِ الْأَحَدِيَّة ﴿﴾ وَبُلُوْغُهَا اِلَى هَذَا الْمَقَامِ الْعَظِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'وَحَيْثُ تَشَرَّفَتِ الْأَسْمَاعُ بِاَخْبَارِ هَذَا الْحَبِيْبِ الْمَحْبُوْب ﴿﴾ وَمَاحَصَلَ لَهُ مِنَ الْكَرَامَةِ فِي عَوَالِمِ الشَّهَادَةِ وَالْغُيُوْب ﴿﴾ تَحَرَّكَتْ هِمَّةُ الْمُتَكَلِّمِ اِلَى نَشْرِ مَحَاسِنِ خَلْقِ هَذَا السَّيِّدِ وَاَخْلَاقِه ﴿﴾ لِيَعْرِفَ السَّامِعُ مَا اَكْرَمَهُ اللهُ بِهِ مِنَ الْوَصْفِ الْحَسَنِ وَالْخَلْقِ الْجَمِيْلِ الَّذِيْ خَصَّصَتْهُ بِهِ عِنَايَةُ خَلَاقِه ﴿﴾ فَلْيُقَابِلِ السَّامِعُ مَا اُمْلِيْهِ عَلَيْهِ مِنْ شَرِيْفِ الْأَخْلَاقِ بِأُذُنٍ وَاعِيَّة ﴿﴾ فَإِنَّهُ سَوْفَ يَجْمَعُهُ مِنْ اَوْصَافِ الْحَبِيْبِ عَلَى الرُّتْبَةِ الْعَالِيَّة ﴿﴾ فَلَيْسَ يُشَابِهُ هَذَا السَّيِّدَ فِي خَلْقِهِ وَاَخْلَاقِهِ بَشَر ﴿﴾ وَلَايَقِفُ اَحَدٌ مِنْ اَسْرَارِ حِكْمَةِ اللهِ فِي خَلْقِهِ وَخُلُقِهِ عَلَى عَيْنٍ وَ لَا اَثَر ﴿﴾ فَإِنَّ الْعِنَايَةَ الْاَزَلِيَّة ﴿﴾ طَبَعَتْهُ عَلَى اَخْلَاقٍ سَنِيَّة ﴿﴾ وَاَقَامَتْهُ فِي صُوْرَةٍ حَسَنَةٍ بَدْرِيَّة ﴿﴾ فَلَقَدْ كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرْبُوْعَ الْقَامَة ﴿﴾ اَبْيَضَ اللَّوْنِ مُشَرَّباً بِحُمْرَه ﴿﴾ وَاسِعَ الْجَبِيْنِ حَسَنَهُ شَعْرُهُ بَيْنَ الجُمَّةِ وَالْوَفْرَة ﴿﴾ وَلَهُ الْاِعْتِدَالُ الْكَامِلُ فِي مَفَاصِلِهِ وَاَطْرَافِه ﴿﴾ وَالْأِسْتِقَامَةُ الْكَامِلَةُ فِي مَحَاسِنِهِ وَاَوْصَافِه ﴿﴾ لَمْ يَأْتِ بَشَرٌ عَلَى مِثْلِ خَلْقِه ﴿﴾ فِي مَحَاسِنٍ نَظَرِهِ وَسَمْعِهِ وَنُطْقِه ﴿﴾ قَدْ خَلَقَهُ اللهُ عَلَى اَجْمَلِ صُوْرَة ﴿﴾ فِيْهَا جَمِيْعُ الْمَحَاسِنِ مَحْصُوْرَه ﴿﴾ وَعَلَيْهَا مَقْصُوْرَة ﴿﴾ إِذَا تَكَلَّمَ نَثَرَ مِنَ الْمَعَارِفِ وَالْعُلُوْمِ نَفَائِسَ الدُّرَر ﴿﴾ وَلَقَدْ اُوْتِيَ مِنْ جَوَامِعِ الْكَلِمِ مَا عَجَزَ عَنِ الْأِتْيَانِ بِمِثْلِهِ مَصَاقِعُ الْبُلَغَاءِ مِنَ الْبَشَر ﴿﴾ تَتَنَزَّهُ الْعُيُوْنُ فِي حَدَائِقِ مَحَاسِنِ جَمَالِه ﴿﴾ فَلَا تَجِدُ مَخْلُوْقاً فِي الْوُجُوْدِ عَلَى مِثَالِه سَيِّدٌ ضِحْكُهُ تَبَسُّمُ وَالْمَشْـ ـيُ الْهُوَيْنَا وَالنَوْمُهُ الْاِغْفَاءُمَا سِوَى الْخُلْقِهِ النَّسِيْمُ وَلَا غَيْـ ـرُ مُهَيَّاهُ الرَّوْضَةُ الْغَنَّاءُرَحْمَةٌ كُلُّهُ وَحَزْمٌ وَعَزْمٌ وَوَقَارٌ وَعِصْمَةٌ وَحَيَاءُمُعْجِزُ القَوْلِ وَالْفِعَالِ الْكَرِيْمُ اَلْخَلْقُ وَالْخُلْقُ مُقْسِطٌ مِعْطَاءُ وَإِذَا مَشَى فَكَأَنَّمَا يَنْحَطُّ مِنْ صَبَبْ ﴿﴾ فَيَفُوْتُ سَرِيْعَ الْمَشْيِ مِنْ غَيْرِهِ خَبَب ﴿﴾ فَهُوَ الْكَنْزُ الْمُطْسَمُ الَّذِيْ لَا يَأْتِي عَلَى فَتْحٍ بَابِ اَوْصَافِهِ مِفْتَاح ﴿﴾ وَالْبَدْرُ التِّمُّ الَّذِيْ يَأْخُذُ الْأَلْبَابَ إِذَا تَخَيَّلَتْهُ اَوْ سَنَاهُ لَهَا لَاحْ حَبِيْبٌ يَغَارُ الْبَدْرُ مِنْ حُسْنِ وَجْهِهِ تَحَيَّرَةِ الْاَلْبَابُ فِى وَصْفِ مَعْنَاهُ فَمَاذَا يُعْرِبُ الْقَوْلُ عَنْ وَصْفٍ يُعْجِزُ الْوَاصِفِيْنَ ﴿﴾ اَوْ يُدْرِكُ الْفَهْمُ مَعْنَى ذَاتٍ جَلَّتْ اَنْ يَكُوْنَ لَهَا فِي وَصْفِهَا مُشَارِكٌ اَوْ قَرِيْن كَمُلَتْ مَحَاسِنُهُ فَلَوْ اَهْدَى السَّنَا لِلْبَدْرِ عِنْدَ تَمَامِهِ لَمْ يُخْسَفِ وَعَلَى تَفَنُّنِ وَاصِفِيْهِ بِوَصْفِهِ يَفْنَ الزَّمَانُ وَفِيْهِ مَالَمْ يُوْصَفِ فَمَا اَجَلَّ قَدْرَهُ الْعَظِيْم ﴿﴾ وَاَوْسَعَ فَضْلَهُ الْعَمِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text: '\n'
                                  'اَللَّهُمَّ صَلِّ وَسَلِّمْ اَشْرَفَ الصَّلَاةِ وَالتَّسْلِيْم عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدِ نِ الرَّؤُوْفُ الرَّحِيْمِ\n'
                                  '\n'
                                  'وَلَقَدِ اتَّصَفَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ مَحَاسِنِ الْأَخْلَاق ﴿﴾ بِمَا تَضِيْقُ عَنْ كِتَابَتِهِ بُطُوْنُ الْأَوْرَاق ﴿﴾ كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اَحْسَنَ النَّاسِ خُلُقاً وَخَلَقاً ﴿﴾ وَاَوَّلَهُمْ اِلَى مَكَارِمِ الْاَخْلَاقِ سَبْقاً ﴿﴾ وَاَوْسَعَهُمْ بِالْمُؤْمِنِيْنَ حِلْماً وَرِفْقاً ﴿﴾ بَرًّا رَؤُفًا ﴿﴾ لَايَقُوْلُ وَلَايَفْعَلُ اِلَّا مَعْرُوْفًا ﴿﴾ لَهُ الْخُلُقُ السَّهْلُ ﴿﴾ وَاللَّفْظُ الْمُحْتَوِيْ عَلَى الْمَعْنَى الْجَزَل ﴿﴾ إِذَا دَعَاهُ الْمِسْكِيْنُ اَجَابَهُ اِجَابَةً مُعَجَّلَة ﴿﴾ وَهُوَ الْأَبُ الشَّفِيْقُ الرَّحِيْمُ بِالْيَتِيْمِ وَالْأَرْمَلَة ﴿﴾ وَلَهُ مَعَ سُهُوْلَةِ اَخْلَاقِهِ الْهَيْبَةُ الْقَوِيَّة ﴿﴾ اَلَّتِيْ تَرْتَعِدُ مِنْهَا فَرَائِصُ الْأَقْوِيَاءِ مِنَ الْبَرِيَّة ﴿﴾ وَمِنْ نَشْرِ طِيْبِهِ تَعَطَّرَتِ الطُّرُقُ وَالْمَنَازِل ﴿﴾ وَبِعَرْفِ ذِكْرِهِ تَطَيَّبَتِ الْمَجَالِسُ وَالْمَحَافِل ﴿﴾ فَهُوَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَامِعُ الصِّفَاتِ الْكَمَالِيَّة ﴿﴾ وَالْمُنْفَرِدُ فِي خَلْقِهِ وَخُلُقِهِ بِأَشْرَفِ خُصُوْصِيَّة ﴿﴾ فَمَا مِنْ خُلُقٍ فِي الْبَرِيَّةِ مَحْمُوْد ﴿﴾ اِلَّا وَهُوَ مُتَلَقًّى عَنْ زَيْنِ الْوُجُوْداَجَمَلْتُ فِى وَصْفِ الْحَبِيْبِ وَشَأْنِهِوَلَهُ العُلَا فِى مَجْدِهِ وَمَكَانِهِ اَوْصَافُ عِزٍّ قَدْ تَعَالَى مَجْدُهَااَخَذَتْ عَلَى نَجْمِ السُّهَا بِعِنَانِهِ وَقَدِ انْبَسَطَ الْقَلَمُ فِي تَدْوِيْنِ مَا اَفَادَهُ الْعِلْمُ مِنْ وَقَائِعِ مَوْلِدِ النَّبِيِّ الْكَرِيْم ﴿﴾ وَحِكاَيَةِ مَا اَكْرَمَ اللهُ بِهِ هَذَا الْعَبْدَ الْمُقَرَّبَ مِنَ التَّكْرِيْمِ وَالتَّعْظِيْمِ وَالْخُلُقِ الْعَظِيْم ﴿﴾ فَحَسُّنَ مِنِّي اَنْ اُمْسِكَ اَعِنَّةَ الْأَقْلَامَ فِي هَذَا الْمَقَام ﴿﴾ وَاَقْرَأُ السَّلَام ﴿﴾ عَلَى سَيِّدِ الْأَنَام ﴿﴾ اَلسَّلَامُ عَلَيْكَ اَيُّهَا النَّبِيُّ وَرَحَمَةُ اللهِ وَبَرَكَاتُه ﴿ثَلَاثًا﴾ وَبِذَلِكَ يَحْسُنُ الْخَتْمُ كَمَا يَحْسُنُ التَّقْدِيْم ﴿﴾ فَعَلَيْهِ اَفْضَلُ الصَّلَاةِ وَالتَّسْلِيْم',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),
                  SizedBox(height: 10), // Add some spacing between the cards
                  Card(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(10),
                    ),
                    elevation: 5,
                    child: Center(
                      child: RichText(
                        textAlign: TextAlign.center,
                        text: TextSpan(
                          style: TextStyle(color: textColor, fontSize: 25),
                          children: <TextSpan>[
                            TextSpan(
                              text:
                                  '\nدعاء مولد سمط الدرار'
                                  '\n'
                                  '\n'
                                  'وَلَمَّا نَظَمَ الْفِكْرُ مِنْ دَرَارِيِّ الْأَوْصَاِف الْمُحَمَّدِيَّةِ عُقُوْداً ﴿﴾ تَوَجَّهْتُ اِلَى اللهِ مُتَوَسِّلاً بِسَيِّدِي وَحَبِيْبِي مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اَنْ يَجْعَلَ سَعْيِيْ فِيْهِ مَشْكُوْراً وَفِعْلِي فِيْهِ مَحْمُوْداً ﴿﴾ وَاَنْ يَكْتُبَ عَمَلِي فِي الْأَعْمَالِ الْمَقْبُوْلَة ﴿﴾ وَتَوَجُّهِي فِي التَّوَجُّهَاتِ الْخَالِصَةِ وَالصِّلَاتِ الْمَوْصُوْلَةِ ﴿﴾ اَللَّهُمَّ يَامَنْ اِلَيْهِ تَتَوَجَّهُ الْمَالُ فَتَعُوْدُ ظَافِرَة ﴿﴾ وَعَلَى بَابِ عِزَّتِهِ تُحَطُّ الرِّحَالُ فَتَغْشَاهَا مِنْهُ الْفُيُوْضُاتُ الْغَامِرَة ﴿﴾ نَتَوَجَّهُ اَلَيْكَ ﴿﴾ بِاَشْرَفِ الْوَسَائِلِ لَدَيْكَ ﴿﴾ سَيِّدِ الْمُرْسَلِيْن ﴿﴾ عَبْدِكَ الصَّادِقِ الْأَمِيْن ﴿﴾ سَيِّدِنَا مُحَمَّدِ نِ الَّذِيْ عَمَّتْ رِسَالَتُهُ الْعَالَمِيْن ﴿﴾ اَنْ تُصَلِّيَ وَتُسَلِّمَ عَلَى تِلْكَ الذَّاتِ الْكَامِلَة ﴿﴾ مُسْتَوْدَعِ اَمَانَتِكَ ﴿﴾ وَحَفِيْظِ سِرِّك ﴿﴾ وَحَامِلِ رَايَةِ دَعْوَتِكَ الشَّامِلَة ﴿﴾ اَلْأَبِ الْأَكْبَر ﴿﴾ اَلْمَحْبُوْبِ لَكَ وَالْمُخَصَّصِ بِالشَّرَفِ الْأَفْخَر ﴿﴾ فِي كُلِّ مُوْطِنٍ مِنْ مَوَاطِنِ الْقُرْبِ وَمَظْهَر ﴿﴾ قَاسِمِ اِمْدَادِكَ فِي عِبَادِك ﴿﴾ وَسَاقِي كُؤُوْسِ اِرْشَادِكَ لِاَهْلِ وِدَادِك ﴿﴾ سَيِّدُ الْكَوْنَيْن ﴿﴾ وَاَشْرَفِ الْثَقَلَيْن ﴿﴾ اَلْعَبْدِ الْمَحْبُوْبِ الْخَالِص ﴿﴾ اَلْمَخْصُوْصِ مِنْكَ بِاَجَلِّ الْخَصَائِص ﴿﴾ اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَيْهِ وَعَلَى اَلِهِ وَاَصْحَابِهِ ﴿﴾ وَاَهْلِ حَضْرَةِ اقْتِرَابِهِ مِنْ اَحْبَابِه ﴿﴾ اَللَّهُمَّ اِنَّ نُقَدِّمُ اِلَيْكَ جَاهَ هَذَا النَّبِيِّ الْكَرِيْم ﴿﴾ وَنَتَوَسَّلُ اِلَيْكَ بِشَرَفِ مَقَامِهِ الْعَظِيْم ﴿﴾ اَنْ تُلَاحِظَنَا فِي حَرَكَاتِنَا وَسَكَنَاتِنَا بِعَيْنِ عِنَايَتِك ﴿﴾ وَاَنْ تَحْفَظَنَا فِي جَمِيْعِ اَطْوَارِنَا وَتَقَلُّبَاتِنَا بِجَمِيْلِ رِعَايَتِك ﴿﴾ وَحَصِيْنِ وِقَايَتِك ﴿﴾ وَاَنْ تُبَلِّغَنَا مِنْ شَرَفِ الْقُرْبِ اِلَيْكَ وَاِلَى هَذَا الْحَبِيْبِ غَايَةَ اَمَالِنَا ﴿﴾ وَتَتَقَبَّلَ مِنَّا مَا تَحَرَّكْنَا فِيْهِ مِنْ نِيَّاتِنَا وَاَعْمَالِنَا ﴿﴾ وَتَجْعَلَنَا فِي حَضْرَةِ هَذَا الْحَبِيْبُ مِنَ الْحَاضِرِيْن ﴿﴾ وَفِي طَرَائِقِ اتِّبَاعِهِ مِنَ السَّالِكِيْن ﴿﴾ وَلِحَقِّكَ وَحَقِّهِ مِنَ الْمُؤَدِّيِيْن ﴿﴾ وَلِعَهْدِكَ مِنَ الْحَافِظِيْن ﴿﴾ اَللَّهُمَّ اِنَّ لَنَا اَطْمَاعاً فِي رَحْمَتِكَ الْخَاصَّةٍ فَلَا تُحْرِمْنَا ﴿﴾ وَظُنُوْناً جَمِيْلَةً هِيَ وَسِيْلَتُنَااِلَيْكَ فَلَا تُخَيِّبْنَا ﴿﴾ اَمَنَّا بِكَ وَبِرَسُوْلِكَ وَمَا جَاءَ بِهِ مِنَ الدِّيْن ﴿﴾ وَتَوَجَّهْنَا بِهِ اِلَيْكَ مُسْتَشْفِعِيْن ﴿﴾ اَنْ تُقَابِلَ الْمُذْنِبَ مِنَّا بِالْغُفْرَان ﴿﴾ وَالْمُسِيْءَ بِالْإِحْسَانِ ﴿﴾ وَالسَّائِلَ بِمَا سَأَلَ ﴿﴾ وَالْمُؤَمِّلَ بِمَا اَمَّل ﴿﴾ وَاَنْ تَجْعَلَنَا مِمَّنْ نَصَرَ هَذَا الْحَبِيْبِ وَ وَازَرَه ﴿﴾ وَ وَالَاهُ وُظَاهَرُه ﴿﴾ وَعُمَّ بِبَرَكَتِهِ وَشَرِيْفِ وِجْهَتِهِ اَوْلَادَنَا وَوَالِدِيْنَا ﴿﴾ وَاَهْلَ قُطْرِنَا وَوَادِيْنَا ﴿﴾ وَجَمِيْعَ الْمُسْلِمِيْنَ وَالْمُسْلِمَات ﴿﴾ وَالْمُؤْمِنِيْنَ وَالْمُؤْمِنَات ﴿﴾ فِي جَمِيْعِ الْجِهَات ﴿﴾ وَ اَدِمْ رَايَةَ الدِّيْنِ الْقَوِيْمِ فِي جَمِيْعِ الْأَقْطَاِر مَنْشُوْرَة ﴿﴾ وَمَعَالِمَ الْأِسْلَامِ وَالْأِيْمَانِ بِاَهْلِهَا مَعْمُوْرَة ﴿﴾ مَعْنىً وَصُوْرَة ﴿﴾ وَاكْشِفِ اللَّهُمَّ كُرْبَةَ الْمَكْرُوْبِيْن ﴿﴾ وَاَقْضِ دَيْنَ الْمَدِيْنِيْن ﴿﴾ وَاغْفِرْ لِلْمُذْنِبِيْن ﴿﴾ وَتَقَبَّلْ تَوْبَةَ التَّائِبِيْن ﴿﴾ وَانْشُرْ رَحْمَتَكَ عَلَى عِبَادِكَ الْمُؤْمِنِيْنَ اَجْمَعِيْن ﴿﴾ وَاكْفِ شَرَّ الْمُعْتَدِيْنَ وَالظَّالِمِيْن ﴿﴾ وَابْسُطِ الْعَدْلَ بِوُلَاةِ الْحَقِّ فِي جَمِيْعِ النَّوَاحِي وَالْأَقْطَار ﴿﴾ وَاَيِّدْهُمْ بِتَأْيِيْدِ مِنْ عِنْدِكَ وَ نَصْرٍ عَلَى الْمُعَانِدِيْنَ مِنَ الْمُنَافِقِيْنَ وَالْكُفَّار ﴿﴾ وَاجْعَلْنَا يَارَبِّ فِي الْحِصْنِ الْحَصِيْنِ مِنْ جَمِيْعِ الْبَلَايَا ﴿﴾ وَفِي الْحِرْزِ الْمَكِيْنِ مِنَ الذُّنُوْبِ وَالْخَطَايَا ﴿﴾ وَاَدِمْنَا فِي الْعَمَلِ بِطَاعَتِكَ وَالصِّدْقِ فِي خِدْمَتِكَ قَائِمِيْن ﴿﴾ وَإِذَا تَوَفَّيْتَنَا فَتَوَفَّنَا مُسْلِمِيْنَ مُؤْمِنِيْن ﴿﴾ وَاخْتِمْ لَنَا مِنْكَ بِخَيْرٍ اَجْمَعِيْن ﴿﴾ وَصَلِّ وَسَلِّمْ عَلَى هَذَا الْحَبِيْبِ الْمَحْبُوْب ﴿﴾ لِلْأَجْسَامِ وَالْأَرْوَاحِ وَالْقُلُوْب ﴿﴾ وَعَلَى اَلِهِ وَصَحْبِهِ وَمِنْ اِلَيْهِ مَنْسُوْب ﴿﴾ وَآخِرُ دَعْوَانَا اَنِ الْحَمْدُلِلَّهِ رَبِّ الْعَالَمِيْن',
                              style: GoogleFonts.scheherazadeNew(
                                  color: textColor,
                                  fontSize: 23,fontWeight: FontWeight.bold
                              ),
                            ),
                          ],
                        ),
                      ),
                    ),
                  ),


                  // Add more Card widgets as needed
                ],
              ),
            ),
          ],
        ),
      ),
    );
  }
}